{"question_id": "0", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Earthworms live underground in the soil. As they move through the soil, they create tunnels. The tunnels help improve the soil. Plants grow better in soil that has earthworms. Which statement explains how earthworm tunnels help plants?"}]}
{"question_id": "1", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "How can I temporarily seal a broken window?"}]}
{"question_id": "2", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "How to clean earbuds"}]}
{"question_id": "5", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "To hold open a bedroom door without a door stopper."}]}
{"question_id": "7", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "To add a surprising twist to the stuffing in a duck, you can"}]}
{"question_id": "14", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How do you season a cast iron skillet?"}]}
{"question_id": "18", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Give car tires traction."}]}
{"question_id": "23", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "when did allied troops land in North Africa"}]}
{"question_id": "27", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Have Les Twins performed at major events such as World of Dance or Juste Debout and collaborated with other famous dancers such as Parris Goebel or Keone Madrid?"}]}
{"question_id": "29", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How do you zoom in on a Mac computer?"}]}
{"question_id": "37", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "mondegreen the following data and create any data or context based on known data and context."}]}
{"question_id": "45", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "A gastroenterologist is a doctor who treats problems of the esophagus, stomach, and intestines. Which organ system is cared for by this type of doctor?"}]}
{"question_id": "46", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "To which planet do National Aeronautics and Space Administration (NASA) scientists hope to send humans next?"}]}
{"question_id": "47", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Context: Introduction\nWriting errors can occur in many different forms – from relatively simple punctuation and determiner errors, to mistakes including word tense and form, incorrect collocations and erroneous idioms. Automatically identifying all of these errors is a challenging task, especially as the amount of available annotated data is very limited. Rei2016 showed that while some error detection algorithms perform better than others, it is additional training data that has the biggest impact on improving performance.\nBeing able to generate realistic artificial data would allow for any grammatically correct text to be transformed into annotated examples containing writing errors, producing large amounts of additional training examples. Supervised error generation systems would also provide an efficient method for anonymising the source corpus – error statistics from a private corpus can be aggregated and applied to a different target text, obscuring sensitive information in the original examination scripts. However, the task of creating incorrect data is somewhat more difficult than might initially appear – naive methods for error generation can create data that does not resemble natural errors, thereby making downstream systems learn misleading or uninformative patterns.\nPrevious work on artificial error generation (AEG) has focused on specific error types, such as prepositions and determiners BIBREF0 , BIBREF1 , or noun number errors BIBREF2 . Felice2014a investigated the use of linguistic information when generating artificial data for error correction, but also restricting the approach to only five error types. There has been very limited research on generating artificial data for all types, which is important for general-purpose error detection systems. For example, the error types investigated by Felice2014a cover only 35.74% of all errors present in the CoNLL 2014 training dataset, providing no additional information for the majority of errors.\nIn this paper, we investigate two supervised approaches for generating all types of artificial errors. We propose a framework for generating errors based on statistical machine translation (SMT), training a model to translate from correct into incorrect sentences. In addition, we describe a method for learning error patterns from an annotated corpus and transplanting them into error-free text. We evaluate the effect of introducing artificial data on two error detection benchmarks. Our results show that each method provides significant improvements over using only the available training set, and a combination of both gives an absolute improvement of 4.3% in INLINEFORM0 , without requiring any additional annotated data.\nError Generation Methods\nWe investigate two alternative methods for AEG. The models receive grammatically correct text as input and modify certain tokens to produce incorrect sequences. The alternative versions of each sentence are aligned using Levenshtein distance, allowing us to identify specific words that need to be marked as errors. While these alignments are not always perfect, we found them to be sufficient for practical purposes, since alternative alignments of similar sentences often result in the same binary labeling. Future work could explore more advanced alignment methods, such as proposed by felice-bryant-briscoe.\nIn Section SECREF4 , this automatically labeled data is then used for training error detection models.\nMachine Translation\nWe treat AEG as a translation task – given a correct sentence as input, the system would learn to translate it to contain likely errors, based on a training corpus of parallel data. Existing SMT approaches are already optimised for identifying context patterns that correspond to specific output sequences, which is also required for generating human-like errors. The reverse of this idea, translating from incorrect to correct sentences, has been shown to work well for\nQuestion: What are their results on both datasets?"}]}
{"question_id": "51", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "A student is designing a model of the solar system and writing a report. She is trying to be as accurate as possible. Which statement should she include in her report?"}]}
{"question_id": "52", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Context: 'Quectel_QuecPython_BC25 开发板使用说明 版本：Quectel_QuecPython_BC25 开发板使用说明_V1.1日期：2021-11-30 状态：临时文件\nQuectel_QuecPython_BC25 开发板使用说明一、基本概述BC25_QuecPython_EVB_V1.1 开发板（本文简称“V1.1 开发板”）是专门针对 BC25 制造，是一款小巧便携的“口袋型”开发板。体型虽小，但是功能丰富，拥 有 SIM 卡座、板载天线、磁开关、LED 等元件。开发者仅需一条 USB Type-C 数据线即可轻松玩转开发板。二、开发板资源Quectel 移远 BC25 通信模组NANO SIM 自弹卡座USB Type-C 数据接口开机按键，唤醒按键磁开关单色灯GPIO 排针上海市闵行区田林路 1016 号科技绿洲 3 期（B 区）5 号楼 200233 邮箱: info@quectel.com 网址: www.quectel.com 1 / 6\n三、开发板介绍Quectel_QuecPython_BC25 开发板使用说明开发板是为方便开发者使用 QuecPython，而设计的一款基于 BC25 通信模块 的开发板，其上集成了开发常用的配置，可以满足开发者的开发需求。V1.1 开发板正面接口V1.1 开发板配置开发板配备了多种外设。明细如下：序 号名称型号是否支持接口类 型1磁开关KTH1601SL-ST3是GPIO2LED 灯S3528UG6W9TLC2G- 是GPIOTJ- 34微动按键GPIOA5--------是是---------上海市闵行区田林路 1016 号科技绿洲 3 期（B 区）5 号楼 200233 邮箱: info@quectel.com 网址: www.quectel.com 2 / 6\nQuectel_QuecPython_BC25 开发板使用说明四、功能详解4.1 磁开关开发板集成了一个磁开关。使用磁铁靠近，可使磁开关输出引脚变为低电平， 默认为高电平。4.2 LED 灯开发板集成了一颗高亮度灯珠，可以用来做显著指示灯。上海市闵行区田林路 1016 号科技绿洲 3 期（B 区）5 号楼 200233 邮箱: info@quectel.com 网址: www.quectel.com 3 / 6\n4.3 按键开发板集成了 2 个微动按键，其功能是 S1 为开机键，S2 为睡眠唤醒按键。Quectel_QuecPython_BC25 开发板使用说明五、调试步骤1.拿到开发板 V1.1 先插上 USB 安装串口驱动，在官方 QQ 群文件搜 CP210 或者自 行百度下载 CP210x 的串口芯片驱动进行安装。2.使用串口工具（例如 QCOM_V1.6）连接 BC25 的主串口（硬件 17、18 脚）。V1.1 选择 Enhanced COM 口，波特率选择 9600,打开串口，按下 PWK 键约一秒松开进 行开机，串口工具收到消息则代表开机成 功，然后按下 EINT 键串口显示 +QATWAKEUP 表示模组唤醒了。3.从 https://python.quectel.com/download 下载 BC25QuecPython 版本固件， 使用 Qflash（群文件下载）选择 BC25 的调试串口（硬件 38、39 脚），波特率选 择 921600，选择 lod 后缀的固件，按下 EINT 键串口工具显示模组已经唤醒串口 工具发 AT+QSCLK=0 可关闭睡眠（不会发 AT 则多按几次 EINT 键），点击 Start 开 始下载固件,下载进度条开始下载，等待下载完成。关闭以上所有工具，并给板 子断电重新上电。4.从 https://python.quectel.com/download 下载 QPYCOM 工具，直接解压运行 工具，选择主串口（同第 2 步），选择 57600 波特率，打开串口。再按 PWK 按键 进行开机，会看到 QPYCOM 有打印 mount.Type \"help()\" for more information.然后就可以进行 QuecPython 的交互调 试了。上海市闵行区田林路 1016 号科技绿洲 3 期（B 区）5 号楼 200233 邮箱: info@quectel.com 网址: www.quectel.com 4 / 6\n六、常见问题解决Quectel_QuecPython_BC25 开发板使用说明Q：模块的固件在哪？A：请登录 QuecPython 网站下载：http://python.quectel.com/downloadQ：哪里有开发板和其他常用资料？A：请登录 QuecPython 网站下载：http://python.quectel.com/downloadP.S. 如果您遇到任何问题，请参照本官网在线文档进行解决或访问 QuecPython 社区进行搜索、交流、提问：QuecPython 社区或者联系我们的在线支持：QQ 群 445121768获取 QuecPython 开发固件及加入官方交流群官网主页：https://python.quectel.com官网文件下载（各类资料、工具）：https://python.quectel.com/download官网 wiki（常用于视频教程、手把手教程下载、API 库）：https://python.quectel.com/wiki/#/官网文档中心(拥有从入门到精通的各种文档介绍、必看)：https://python.quectel.com/doc/工单系统：https://workorder.quectel.com/QuecPython 社区：https://forumschinese.quectel.com/c/function-subjects/quectpython/43QuecPython 官方 QQ 开发交流群：445121768微信公众号：QuecPython移远 OTA 升级平台： https://cloudota.quectel.com/移远 IoT 管理平台：https://python.quectel.com/doc/doc/Advanced_development/zh/QuecPython Cloud/QuecCloud.html上海市闵行区田林路 1016 号科技绿洲 3 期（B 区）5 号楼 200233 邮箱: info@quectel.com 网址: www.quectel.com 5 / 6\n附录 1 V1.1 开发板丝印图Quectel_QuecPython_BC25 开发板使用说明附录 2 V1.1 开发板原理图上海市闵行区田林路 1016 号科技绿洲 3 期（B 区）5 号楼 200233 邮箱: info@quectel.com 网址: www.quectel.com 6 / 6\nPIU101 PIU102 PIU103 PIU104 PIU105 PIU106 PIU107 PIU108 COR9 PIR902 PIR901 PIU109 PIU1010 PIU1011 PIU1012 PIU1013 PIU1044 PIU1043 PIU1042 PIU1041 PIU1040 PIU1039 PIU1038 PIU1037 PIU1036 COU1A PIU1014 PIU1015 PIU1016 PIU1017 PIU1018 PIU1019 PIU1020 PIU1021 PIU1022 PIU1035 PIU1034 PIU1033 PIU1032 PIU1031 PIU1030 PIU1029 PIU1028 PIU1027 PIU1026 PIU1025 PIU1024 PIU1023 COJ1 PIJ101 COC1 PIC101 PIC102 COC2 PIC201 PIC202 PIC602 COC6 PIC601 COR22 PIR2201 PIR2301 COR23 COR24 PIR2401 PIR2501 COR25 COR14 PIR1401 PIR1601 COR16 PIR2202 PIR2302 PIR2402 PIR2502 PIR1402 PIR1602 COC14 PIC1402 PIC1401 COR33 PIR3301 PIR3302 COU2 PIU201 PIU202 PIU203 PIR3002 COR30 COD6 PIR3001 PID601 PID602 COR31 PIR3102 PIR3101 PIQ201 PIQ203 COQ2 COR32 PIQ202 PIR3201 PIR3202 COR1 COD1 PIR102 PIR101 PID101 PID102 PIQ103 COQ1 PIQ102 COR13 PIR1302 PIR1301 PIQ101 PIR1501 COR15 PIR1502 PIR302 COR3 PIR301 PIR402 COR4 PIR401 PIU1045 PIU1046 PIU1047 PIU1048 PIU1049 PIU1050 PIU1051 PIU1052 PIU1053 COR19 PIR1902 PIR1901 COR20 PIR2002 PIR2001 PIU1072 PIU1071 PIU1070 PI\nQuestion: Where can users go for troubleshooting and support?"}]}
{"question_id": "53", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Are the efficiencies of Inspection and Testing comparable?"}]}
{"question_id": "54", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Spatial Concept Acquisition for a Mobile Robot that Integrates Self-Localization and Unsupervised Word Discovery from Spoken Sentences\nAbstract: In this paper, we propose a novel unsupervised learning method for the lexical acquisition of words related to places visited by robots, from human continuous speech signals. We address the problem of learning novel words by a robot that has no prior knowledge of these words except for a primitive acoustic model. Further, we propose a method that allows a robot to effectively use the learned words and their meanings for self-localization tasks. The proposed method is nonparametric Bayesian spatial concept acquisition method (SpCoA) that integrates the generative model for self-localization and the unsupervised word segmentation in uttered sentences via latent variables related to the spatial concept. We implemented the proposed method SpCoA on SIGVerse, which is a simulation environment, and TurtleBot2, which is a mobile robot in a real environment. Further, we conducted experiments for evaluating the performance of SpCoA. The experimental results showed that SpCoA enabled the robot to acquire the names of places from speech sentences. They also revealed that the robot could effectively utilize the acquired spatial concepts and reduce the uncertainty in self-localization.\n\nHow do they evaluate how their model acquired words?"}]}
{"question_id": "61", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To make old glass bottles into an instrument,"}]}
{"question_id": "62", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Why can a small fire be put out by placing a heavy blanket over it?"}]}
{"question_id": "64", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To get a double-double in a basketball game,"}]}
{"question_id": "65", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How many pounds are there in one stone?"}]}
{"question_id": "67", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Context: Introduction\nNatural languages evolve and words have always been subject to semantic change over time BIBREF1. With the rise of large digitized text resources recent NLP technologies have made it possible to capture such change with vector space models BIBREF2, BIBREF3, BIBREF4, BIBREF5, topic models BIBREF6, BIBREF7, BIBREF8, and sense clustering models BIBREF9. However, many approaches for detecting LSC differ profoundly from each other and therefore drawing comparisons between them can be challenging BIBREF10. Not only do architectures for detecting LSC vary, their performance is also often evaluated without access to evaluation data or too sparse data sets. In cases where evaluation data is available, oftentimes LSCD systems are not evaluated on the same data set which hinders the research community to draw comparisons.\nFor this reason we report the results of the first shared task on unsupervised lexical semantic change detection in German that is based on an annotated data set to guarantee objective reasoning throughout different approaches. The task was organized as part of the seminar 'Lexical Semantic Change Detection' at the IMS Stuttgart in the summer term of 2019.\nTask\nThe goal of the shared task was to create an architecture to detect semantic change and to rank words according to their degree of change between two different time periods. Given two corpora Ca and Cb, the target words had to be ranked according to their degree of lexical semantic change between Ca and Cb as annotated by human judges. A competition was set up on Codalab and teams mostly consisting of 2 people were formed to take part in the task. There was one group consisting of 3 team members and two individuals who entered the task on their own. In total there were 12 LSCD systems participating in the shared task.\nThe shared task was divided into three phases, i.e., development, testing and analysis phase. In the development phase each team implemented a first version of their model based on a trial data set and submitted it subsequently. In the testing phase the testing data was made public and participants applied their models to the test data with a restriction of possible result uploads to 30. The leaderboard was public at all times. Eventually, the analysis phase was entered and the models of the testing phase were evaluated in terms of the predictions they made and parameters could be tuned further. The models and results will be discussed in detail in sections 7 and 8.\nCorpora\nThe task, as framed above, requires to detect the semantic change between two corpora. The two corpora used in the shared task correspond to the diachronic corpus pair from BIBREF0: DTA18 and DTA19. They consist of subparts of DTA corpus BIBREF11 which is a freely available lemmatized, POS-tagged and spelling-normalized diachronic corpus of German containing texts from the 16th to the 20th century. DTA18 contains 26 million sentences published between 1750-1799 and DTA19 40 million between 1850-1899. The corpus version used in the task has the following format: \"year [tab] lemma1 lemma2 lemma3 ...\".\nEvaluation\nThe Diachronic Usage Relatedness (DURel) gold standard data set includes 22 target words and their varying degrees of semantic change BIBREF12. For each of these target words a random sample of use pairs from the DTA corpus was retrieved and annotated. The annotators were required to rate the pairs according to their semantic relatedness on a scale from 1 to 4 (unrelated - identical meanings) for two time periods. The average Spearman's $\\rho $ between the five annotators was 0.66 for 1,320 use paris. The resulting word ranking of the DURel data set is determined by the mean usage relatedness across two time periods and is used as the benchmark to compare the models’ performances in the shared task.\nEvaluation ::: Metric\nThe output of a system with the target words in the predicted order is compared to th\nQuestion: What is the corpus used for the task?"}]}
{"question_id": "84", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Prevent side car mirrors from freezing."}]}
{"question_id": "85", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Why is some food dehydrated for astronauts to eat in space?"}]}
{"question_id": "88", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Given a phrase describing the relationship between two words, extract the words and the lexical relationship between them. The relation has to be of the type 'MemberOf', 'MadeOf', 'Synonym', 'Entails', 'HasA', 'HasProperty', 'PartOf', 'Antonym' or 'IsA'. The output should have the format: word1 relation word2.\n\nExample input: account can be used with the same meaning of report\nExample output: account Synonym report\nExample explanation: The output is correct as the input describes the relationship between account and report, and the relation is that of having the same meaning, therefore they have a Synonym relationship.\nQ: edge can be used with the same meaning of bind\nA:"}]}
{"question_id": "97", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Convert to Moscow time zone: \nFebruary 07, 2023 20:00 UTC"}]}
{"question_id": "103", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Story Ending Generation with Incremental Encoding and Commonsense Knowledge\nAbstract: Generating a reasonable ending for a given story context, i.e., story ending generation, is a strong indication of story comprehension. This task requires not only to understand the context clues which play an important role in planning the plot but also to handle implicit knowledge to make a reasonable, coherent story. In this paper, we devise a novel model for story ending generation. The model adopts an incremental encoding scheme to represent context clues which are spanning in the story context. In addition, commonsense knowledge is applied through multi-source attention to facilitate story comprehension, and thus to help generate coherent and reasonable endings. Through building context clues and using implicit knowledge, the model is able to produce reasonable story endings. context clues implied in the post and make the inference based on it. Automatic and manual evaluation shows that our model can generate more reasonable story endings than state-of-the-art baselines.\n\nWhich baselines are they using?"}]}
{"question_id": "106", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Make a water fountain with a hose"}]}
{"question_id": "107", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "People are developing electric cars that would replace gasoline-burning cars. One major advantage of the electric car is that it"}]}
{"question_id": "113", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Is the cooking method for Dim Sum different from the cooking method for Bubble Tea?"}]}
{"question_id": "135", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "How do the number of native speakers of Kinyarwanda and Swahili compare?"}]}
{"question_id": "138", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "how do you delete friends on find my friends?"}]}
{"question_id": "140", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Which of the following identifies the primary function of a radio station tower in a communication system?"}]}
{"question_id": "142", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "ich programmiere in python"}]}
{"question_id": "148", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Was the death toll of Hurricane Harvey smaller than that of Hurricane Katrina?"}]}
{"question_id": "159", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Find a substitute for Rosemary for baking and cooking."}]}
{"question_id": "162", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "who did the Houston Astros play in the world series last year"}]}
{"question_id": "163", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "A ploynomial equation is a sum of terms. Here each term is either a constant number, or consists of the variable x raised to a certain power and multiplied by a number. These numbers are called weights. For example, in the polynomial: 2x^2+3x+4, the weights are: 2,3,4. You can present a polynomial with the list of its weights, for example, equation weights = [6, 4] represent the equation 6x + 4 and equation weights = [1, 3, 4] represent the equation 1x^2 + 3x + 4. In this task, you need to compute the result of a polynomial expression by substituing a given value of x in the given polynomial equation. Equation weights are given as a list.\n\nx = 1, equation weights = [9, 4, 8, 0, 3]"}]}
{"question_id": "164", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "how to learn spanish without classes?"}]}
{"question_id": "167", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Il y a une forte corrélation entre les ventes de lunettes de soleil et les ventes de glaces. Pendant les journées chaudes et ensoleillées, les deux se vendent beaucoup plus ; et pendant les journées plus froides et plus nuageuses, les deux se vendent beaucoup moins. Un jour, le camion de lunettes de soleil tombe en panne sur l'autoroute avant d'arriver au magasin, et les ventes de lunettes de soleil tombent à zéro. Qu'arrive-t-il aux ventes de crème glacée ?"}]}
{"question_id": "170", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How do I decide where to put the eye holes in the mask?"}]}
{"question_id": "174", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Context: '用户指南 * User Guide 02 CN 11 EN * 包装内含 使用前注意事项 快速引导 产品部件详情说明 操作说明 02 02 03 06 08 01 \n•本产品支持在系统设置中进行瞳距调节 , 调节时请务必注意，最小瞳距可能会碰触鼻梁。当您佩戴头盔后，您 “显示”中进行手动调节，请注意设置使用不合适的瞳距，可能会引起视觉重影或者眼睛疲劳。 可在“设置” ► •本产品“护眼模式”经德国 TÜV Rheinland 低蓝光认证，通过软件算法降低三色通道中的蓝光量，来达到保护 “护眼” “色彩调节” 眼睛的作用，该模式下画面颜色偏黄，您可根据个人喜好在“设置” 中激活或关闭此功能。 ““显示” ► ► ► 包装内含： VR 头盔 / 手柄 × 2 / 1.5V AA 碱性干电池 × 4/ 眼镜支架 / 遮光鼻托 / 手柄挂绳 × 2 / USB-C 电源适配器 / USB-Cto C 2.0 数据线 / 快速指南 / 用户指南 / 安全与质保指南使用前注意事项 •本产品在开阔的室內环境使用体验最佳，建议至少预留 2×2 米 的空间。使用前请确认身体没有不适且周围环 境安全，特别是佩戴头盔在室内行走移动时，要尽量避免发生意外。 •不建议 12 岁及以下儿童使用本产品，建议将头盔、手柄和配件置于儿童够不到的位置，13 岁以上青少年须在 成人监护下使用，以免发生意外。 •本产品无近视调节功能，近视用户请佩戴眼镜使用并尽量避免近视眼镜被头盔的光学镜片磨伤或刮伤。建议在 使用和收纳时注意防护光学镜片，避免尖锐物体划伤镜片，擦拭清洁时请使用柔软的眼镜布，否则可能划伤镜片， 影响视觉效果。 •长时间使用可能引发轻微的昡晕或者眼疲劳，建议使用 30 分钟后适当休息，可通过眼保健操或观看远处物体缓 解眼疲劳。如果您的身体感到任何不适，请立即停止使用。如果不适持续，请咨询医生。 •当头盔镜片被阳光或紫外线照射时（尤其在户外、阳台、窗台及汽车内存放时），可能导致屏幕出现永久性黄斑。 请尽量避免该情况发生，此种屏幕损坏不在产品的质保范围内。 *本产品最终外观及功能以实物为准，部分地区包装内含物品有所差异，本说明仅供参考。 02 CN\n六自由度 VR 体验 本产品可以追踪头盔和手柄前、后、左、右、上、下和旋转的运动状态，您在现实中的肢体运动会实时反映在虚 拟世界中。 由于没有任何线缆的束缚，您在虚拟世界自由探索时请确保游玩区域的安全。 1. 建议准备一个整洁安全的体验空间：至少 2×2 米；保持房间明亮，避免在只有单色的墙或大面积玻璃、镜子类 反射物以及许多移动画面和物体的空间中使用。 2. 撕下 VR 头盔前端摄像头上的保护膜，并佩戴手柄挂绳。 3. 根据开机后的画面提示进行游玩区域的设定。 ❶ 安装电池 按箭头方向拔出电池盖侧边的绝缘纸 快速引导 提示：本产品虚拟的安全区提醒功能，不能完全保证您在设定好的游戏区域中的安全，请时刻注意周围的安全情况。 提示：建议使用 1.5V AA 碱性电池。 按照图示拨动电池盖拨钮打开电池盖更换电池。 03 CN\n❷ 手柄开机 ❸ 头盔开机 ❹ 佩戴头盔，调节至清晰舒适的位置 首次开机：拔出绝缘纸，手柄自动开机（蓝灯闪烁） 非首次开机：短按手柄 Home 键开机（蓝灯闪烁） 长按头盔电源键 2 秒（蓝灯常亮） 调节旋钮转动绑带，使后脑垫套在头上，微调绑带长度及佩戴位置至视野清晰 04 提示：近视用户请佩戴眼镜或镜片插件使用，本产品不具备近视调节功能。 CN\n❺ 微调顶绑带 微调顶绑带使其受力以减少额头压力 ❻ 瞳 距 调 节 在系统设置：“设置” ► “显示”界面中进行瞳距调节，点击“+”或“-”按钮可微调瞳距直至画面清晰 64mm 请勿 强行 掰动镜 筒，以 免造 成损坏 ！ 请注 意设 置使用 不合适 的瞳 距，可 能 会引起 视 觉重影 或 者眼睛 疲 劳。准 确 的瞳距 设 置有助 于 获得清 晰 的图像 并 减少眼睛 疲劳。 05 CN\n产品部件详情说明 头盔状态指示灯 蓝灯常亮：开机进行中或工作状态 黄灯常亮：充电中，电量低于 98% 红灯常亮：充电中，电量低于 20% 绿灯常亮：充电完毕，电量大于 98% 或 充满 蓝灯闪烁：关机进行中 红灯闪烁：电量低于 20% 指示灯熄灭：休眠或关机 06 ① 电源键 开机：长按 2 秒 关机：长按 5 秒 复位：长按 10 秒 开机时，短按休眠 ② ③ ④ ⑤ 状态指示灯 贴脸泡棉 音量键 彩色透视摄像头 使用时请勿遮挡 ⑥ ⑦ ⑧ 顶部绑带 可拆卸 绑带旋钮 环境追踪摄像头 使用时请勿遮挡 ⑨ ⑩ ⑪ USB-C 接口 左 / 右喇叭 距离传感器 佩戴头盔后，系统自动唤醒 摘下头盔后，系统自动休眠 ⑫ ⑬ 眼球追踪摄像头 此功能仅 Pro 版支持 使用时请勿遮挡 面部追踪摄像头 此功能仅 Pro 版支持 使用时请勿遮挡 CN\n手柄状态指示灯 熄灭：已连接或者关机 蓝灯常亮：固件升级模式 蓝灯闪烁：连接中 红蓝灯交替慢速闪烁：等待配对 ① ② 摇杆 菜单键 ③ Home 键 开机 : 短按关机 : 长按 6 秒退出应用 : 短按屏幕中心校正 : 长按 1 秒④ ⑤ ⑥ ⑦ 状态指示灯 抓握键 截屏键 扳机键 ⑧ ⑨ 电池盒 打开：拨动拨钮，电池盒弹出 安装：按压直至自动锁紧 追踪光环 使用时请勿遮挡 注：手柄挂绳可按图示将粗绳穿过细绳并锁紧在手柄尾端 07 CN\n手柄硬件复位 如果手柄出现按 Home 键和任何按键均无反应或者头盔中虚拟手柄卡死不动的问题可拆装电池重新启动手柄。 近视用户配戴 本设备不具备近视调节功能，头盔可支持佩戴镜框宽度小于 150mm 的大多数标准眼镜。 操作说明 头控模式 未连接手柄的情况下，您可通过转动头部光标及点击头盔音量加减按键进行操作。 切换主控手柄射线 在主控菜单下，短按对应手柄的扳机键可以切换主控手柄的射线。 屏幕中心校正 戴着头盔直视前方，按住手柄 Home 键（或头控模式下头盔上的音量减键）1 秒以上，进行屏幕中心的校正将菜 单拉到当前视野朝向位置。 断开手柄 长按手柄 Home 键直至手柄状态指示灯红灯亮起并伴随振动产生时即可松手，此时手柄关机并断开与头盔的连接。 您无需刻意进行手柄关机操作，在以下状态下手柄会自动关机省电： •头盔进入深度休眠时（摘下头盔后一段时间） •头盔手柄管理界面解绑手柄时 •头盔关机时 添加新手柄 如需添加新手柄（头盔最多可同时连接一对手柄，即左右手柄各一只），或解绑手柄后再次连接 , 可进入“设置” “手 柄”，点击“配对”，同时按住手柄 Home 键和扳机键直至手柄状态指示灯红蓝交替闪烁时即可松开，然后根据 头盔画面提示操作。 ► 休眠 / 唤醒 方式一：摘下头盔一段时间后，系统自动休眠；戴上头盔时，系统自动唤醒。 方式二：短按头盔电源键也可以进行休眠或唤醒操作。 硬件复位 头盔硬件复位 如果头盔出现短按头盔电源键没有反应或头盔的画面卡死等问题，可以长按头盔电源键 10 秒以上重新启动头盔。 08 CN\n安装眼镜支架 安装遮光鼻托 如您存在眼镜摩擦光学镜片或者压迫鼻梁的问题，请按照图示安装眼镜支架以增加间隔空间。 您可根据佩戴的舒适度选择是否安装。 如您感觉鼻子处漏光影响体验，请按照图示安装遮光鼻托配件。 由于眼睛空间密闭可能加剧起雾及出汗问题，您可根据喜好选择是否安装。 ❶ 摘下贴脸泡棉 ❷ 将眼镜支架按照图示安装在产品上 ❸ 将贴脸泡棉按照图示安装眼镜支架上 ❶ 摘下贴脸泡棉 ❸ 安装贴脸泡棉❷ 将遮光鼻托按照图示方式安装在贴脸泡棉上 注：按照图示拆卸眼镜支架 09 CN\n更换贴脸泡棉 贴脸泡棉多次清洁和长时间使用后会变色和质地变软，您可酌情更换新泡棉。 更换顶绑带 摘下贴脸泡棉 ❸ 安装贴脸泡棉 按照图示捏住顶绑带金属扣，往下压到底然后抽出 ❷ •购买优质热门应用 •畅 聊 社 区， 与 众 多 PICO 玩 家 一起探索 VR 世界 •管理设备更便捷 •参与丰富互动活动 •更多精彩内容等你来发现 ❶ 微 信公 众 号：PICO VR抖音：PICO官 方 旗 舰 店哔 哩 哔 哩：PICO-VR官 方微 博：PICO-VR ❶ ❷ 10 CN\nIn The Box: VR Headset / 2 Controllers / 4 1.5V AA Alkaline Batteries / Glasses Spacer / Nose Pad / 2 Controller Lan- yards / USB-C Power Adapter / USB-C to C 2.0 Data Cable / Quick Guide / User Guide / Safety and WarrantyGuide Important Health & Safety Notes • This product is designed and intended to be used in an open and safe indoor area, free of anytripping or slipping hazards. To avoid accidents, remain conscious to the potential confines ofyour physical area and respect the boundary of your virtual are\nQuestion: What is the recommended space for using the VR headset?"}]}
{"question_id": "177", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Cuando quieres seleccionar una \"Paleta de colores\" para un proyecto, ya sea el desarrollo de un videojuego, una portada, un logo, etc, ¿exactamente qué características abarca \"Paleta de Colores\"?"}]}
{"question_id": "190", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "I heard that dogs are allergic to chocolate, is this true?"}]}
{"question_id": "191", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How to Become EMT Certified"}]}
{"question_id": "194", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "One way to protect against food poisoning is to"}]}
{"question_id": "195", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Does this Real Estate Agent have good communication skills?"}]}
{"question_id": "197", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Where can I see a bengal tiger"}]}
{"question_id": "200", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Can you recommend a book for me to read? ideal one on Audible. I like isekai, post-apocalyptic, space travel, medieval fantasy, comedy, alternate history, alternate reality and so forth. some particular books I like include the Discworld series, The Long Earth, The Pillars of the Earth and the Forever War."}]}
{"question_id": "206", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How does the Stick Insect use mimicry and camouflage to adapt in its environment?"}]}
{"question_id": "208", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Macaw: An Extensible Conversational Information Seeking Platform\nAbstract: Conversational information seeking (CIS) has been recognized as a major emerging research area in information retrieval. Such research will require data and tools, to allow the implementation and study of conversational systems. This paper introduces Macaw, an open-source framework with a modular architecture for CIS research. Macaw supports multi-turn, multi-modal, and mixed-initiative interactions, and enables research for tasks such as document retrieval, question answering, recommendation, and structured data exploration. It has a modular design to encourage the study of new CIS algorithms, which can be evaluated in batch mode. It can also integrate with a user interface, which allows user studies and data collection in an interactive mode, where the back end can be fully algorithmic or a wizard of oz setup. Macaw is distributed under the MIT License.\n\nWhat functionality does Macaw provide?"}]}
{"question_id": "210", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "อยากมีเวลาว่างมากกว่านี้ บริหารเวลาอย่างไรดี ช่วยแนะนำให้หน่อย"}]}
{"question_id": "211", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Make a soft boiled egg ( a three minute egg)"}]}
{"question_id": "214", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How to make an Oil and Ice Density Experiment"}]}
{"question_id": "219", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To entertain children without electronics,"}]}
{"question_id": "221", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "What is the focus of the Montessori Method?"}]}
{"question_id": "226", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To remove excess grease from the cooked bacon for the zombie burger"}]}
{"question_id": "228", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to thread a sewing needle."}]}
{"question_id": "229", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to make chinese fried rice"}]}
{"question_id": "241", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Infections may be caused by"}]}
{"question_id": "247", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "I want you to translate the json documents I provide into a schema in YAML format"}]}
{"question_id": "254", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Hydrochloric acid (HCl) reacts with sodium hydroxide (NaOH) to produce a saltwater solution. What are the products of this chemical reaction?"}]}
{"question_id": "261", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Instructions: In this task, you will be given a short story. One sentence from the story is chosen. Consider the likely emotions of the participants in the sentence and those affected by it. Is any of these emotions caused by the sentence? You should write your answer in the form \" A >Causes> B\". Try to use phrases and sentences from the story to compose your answer when possible. For the sentence describing the result, you must use the verb feel(s).\nInput: story: John walked outside one weekend morning. He noticed that his yard was incredibly sloppy and overgrown. John went to his shed and pulled out his lawn mower. After starting it up, John began to mow his lawn. He worked for an hour, and then his yard looked great again.\n selected sentence: He worked for an hour, and then his yard looked great again.\nOutput:"}]}
{"question_id": "270", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to evenly apply beeswax to shoes for waterproofing"}]}
{"question_id": "271", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Can you play the game Empyrion in first person?"}]}
{"question_id": "280", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "A disease that can be passed from one person to another is best described as being"}]}
{"question_id": "283", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "when did louisiana became a part of The United States"}]}
{"question_id": "296", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "where is Allegheny River located on a map"}]}
{"question_id": "298", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To tenderize and flatten a steak, you can"}]}
{"question_id": "315", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Gender Representation in Open Source Speech Resources\nAbstract: With the rise of artificial intelligence (AI) and the growing use of deep-learning architectures, the question of ethics, transparency and fairness of AI systems has become a central concern within the research community. We address transparency and fairness in spoken language systems by proposing a study about gender representation in speech resources available through the Open Speech and Language Resource platform. We show that finding gender information in open source corpora is not straightforward and that gender balance depends on other corpus characteristics (elicited/non elicited speech, low/high resource language, speech task targeted). The paper ends with recommendations about metadata and gender information for researchers in order to assure better transparency of the speech systems built using such corpora.\n\nWhat corpus characteristics correlate with more equitable gender balance?"}]}
{"question_id": "333", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Diamonds are sometimes used as the tips of drill bits. Which physical property of a diamond MOST likely makes it a good cutting tool?"}]}
{"question_id": "334", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "To secure flaps in a cardboard box, you can"}]}
{"question_id": "340", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "A vaccine can prevent a serious disease. When a new vaccine is developed, it is given to a small group of people. Why would it be important to test each vaccine on a small group of people before everyone can have one?"}]}
{"question_id": "350", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "A manufacturer wants to produce a container for food storage that does not break easily and is airtight, inexpensive, and microwave-safe. Which of the following is the best material to use to make the container?"}]}
{"question_id": "357", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Chinese and European societies can use different but effective technologies when addressing medical questions. What does this demonstrate?"}]}
{"question_id": "360", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Compressing BERT: Studying the Effects of Weight Pruning on Transfer Learning\nAbstract: Universal feature extractors, such as BERT for natural language processing and VGG for computer vision, have become effective methods for improving deep learning models without requiring more labeled data. A common paradigm is to pre-train a feature extractor on large amounts of data then fine-tune it as part of a deep learning model on some downstream task (i.e. transfer learning). While effective, feature extractors like BERT may be prohibitively large for some deployment scenarios. We explore weight pruning for BERT and ask: how does compression during pre-training affect transfer learning? We find that pruning affects transfer learning in three broad regimes. Low levels of pruning (30-40\\%) do not affect pre-training loss or transfer to downstream tasks at all. Medium levels of pruning increase the pre-training loss and prevent useful pre-training information from being transferred to downstream tasks. High levels of pruning additionally prevent models from fitting downstream datasets, leading to further degradation. Finally, we observe that fine-tuning BERT on a specific task does not improve its prunability. We conclude that BERT can be pruned once during pre-training rather than separately for each task without affecting performance.\n\nHow they observe that fine-tuning BERT on a specific task does not improve its prunability?"}]}
{"question_id": "373", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "What are the popular styles of Victoria's Secret in swimwear?"}]}
{"question_id": "376", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "how do you file down a dogs teeth?"}]}
{"question_id": "377", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "In the past, Native American Indians buried dead fish along with corn seeds. This technique was used because the decomposing dead fish would"}]}
{"question_id": "380", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "A boy pulls a sweater off over his head. His hair is attracted to the sweater due to"}]}
{"question_id": "384", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "to make your shoes waterproof"}]}
{"question_id": "389", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How can I get this pimple to go away?"}]}
{"question_id": "394", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Rethinking travel behavior modeling representations through embeddings\nAbstract: This paper introduces the concept of travel behavior embeddings, a method for re-representing discrete variables that are typically used in travel demand modeling, such as mode, trip purpose, education level, family type or occupation. This re-representation process essentially maps those variables into a latent space called the \\emph{embedding space}. The benefit of this is that such spaces allow for richer nuances than the typical transformations used in categorical variables (e.g. dummy encoding, contrasted encoding, principal components analysis). While the usage of latent variable representations is not new per se in travel demand modeling, the idea presented here brings several innovations: it is an entirely data driven algorithm; it is informative and consistent, since the latent space can be visualized and interpreted based on distances between different categories; it preserves interpretability of coefficients, despite being based on Neural Network principles; and it is transferrable, in that embeddings learned from one dataset can be reused for other ones, as long as travel behavior keeps consistent between the datasets.  ::: The idea is strongly inspired on natural language processing techniques, namely the word2vec algorithm. Such algorithm is behind recent developments such as in automatic translation or next word prediction. Our method is demonstrated using a model choice model, and shows improvements of up to 60\\% with respect to initial likelihood, and up to 20% with respect to likelihood of the corresponding traditional model (i.e. using dummy variables) in out-of-sample evaluation. We provide a new Python package, called PyTre (PYthon TRavel Embeddings), that others can straightforwardly use to replicate our results or improve their own models. Our experiments are themselves based on an open dataset (swissmetro).\n\nHow do they model travel behavior?"}]}
{"question_id": "408", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Cutting wire for extension cord."}]}
{"question_id": "420", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To make an easy Father's day gift,"}]}
{"question_id": "421", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "q: He was trying to buy a new mattress, he wanted something soft yet what?\nOptions:\n- hexachord\n- loud\n- hard\n- harsh\n- firm\na: A new mattress should be firm as well as soft. As he was trying to buy a new mattress so he wanted it to be soft yet firm.\nThe answer is firm\n\n\nQUESTION: When remembering a tragedy in the past, what do many people feel?\nOptions:\n- depression\n- pain\n- nostalgia\n- knowing\n- knowledge\nANSWER: Tragedy is a bad event that causes depression. Many people feels depression while remembering the tragedy that has been happened in the past.\nThe answer is depression\n\n\nq: How can you tell whether people are rich?\nOptions:\n- sleep together\n- own things\n- live long\n- believe in god\n- need each other\na: Rich people are those who have a lot of money. People tend to buy many things with their money. People own the things they buy.\nThe answer is own things\n\n\nQUESTION: If you are fiddling through a music book when you should be playing, you probably dont have?\nOptions:\n- practice\n- dexterity\n- idle time\n- knowledge of music\n- conductor\nANSWER: When person don't have knowledge of music, he just fiddle the music book instead of playing music from it. To read the notation of music theory book person must have knowledge of music.\nThe answer is knowledge of music\n\n\nq: Where are there more telephone booths?\nOptions:\n- gas stations\n- city\n- london\n- train station\n- airport\na: In a city, there are many telephone booths. Every city contains many telephone booths to facilitate its people.\nThe answer is city\n\n\nq: As he looked out the window, he knew the landing was happening soon, and it made him nervous, but where would he be soon?\nOptions:\n- apartment building\n- disembark\n- stairwell\n- deplane\n- airport\na:"}]}
{"question_id": "427", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "To put several files in one folder in a computer"}]}
{"question_id": "431", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: State-of-the-Art Vietnamese Word Segmentation\nAbstract: Word segmentation is the first step of any tasks in Vietnamese language processing. This paper reviews stateof-the-art approaches and systems for word segmentation in Vietnamese. To have an overview of all stages from building corpora to developing toolkits, we discuss building the corpus stage, approaches applied to solve the word segmentation and existing toolkits to segment words in Vietnamese sentences. In addition, this study shows clearly the motivations on building corpus and implementing machine learning techniques to improve the accuracy for Vietnamese word segmentation. According to our observation, this study also reports a few of achivements and limitations in existing Vietnamese word segmentation systems.\n\nWhat are the limitations of existing Vietnamese word segmentation systems?"}]}
{"question_id": "432", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How can I get a ketchup packet open?"}]}
{"question_id": "439", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How can I acquire more crochet material without buying it at a specialty store?"}]}
{"question_id": "445", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "In this task, you are given a sentence from the Quran in English, and your task is to translate it into Persian.\n\nQ: And those who believe in Allah and His messengers- they are the Sincere (lovers of Truth), and the witnesses (who testify), in the eyes of their Lord: They shall have their Reward and their Light. But those who reject Allah and deny Our Signs,- they are the Companions of Hell-Fire.\n\nA: و کسانی که به خدا و پیامبرش ایمان آوردند، آنانند که صدیقان و گواهان [اعمال] نزد پروردگارشان هستند، [و] برای آنان است پاداش [اعمال] شان و نور [ایمان] شان و کسانی که کفر ورزیدند و آیات ما را انکار کردند، آنان اهل دوزخ اند.\n****\nQ: He it is That has made you inheritors in the earth: if, then, any do reject (Allah), their rejection (works) against themselves: their rejection but adds to the odium for the Unbelievers in the sight of their Lord: their rejection but adds to (their own) undoing.\n\nA: او کسی است که شما را در زمین جانشینان [دیگران] قرار داد. پس کسی که کافر شود کفرش به زیان خود اوست، و کافران را کفرشان نزد پروردگارشان جز دشمنی و خشم نمی‌افزاید، و کافران را کفرشان جز خسارت اضافه نمی‌کند.\n****\nQ: In the long run evil in the extreme will be the End of those who do evil; for that they rejected the Signs of Allah, and held them up to ridicule.\n\nA:"}]}
{"question_id": "455", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "To warm up after coming in from the snow,"}]}
{"question_id": "463", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To put a bedspread on correctly"}]}
{"question_id": "466", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To make a sauce for enchiladas."}]}
{"question_id": "468", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Graph-based Filtering of Out-of-Vocabulary Words for Encoder-Decoder Models\nAbstract: Encoder-decoder models typically only employ words that are frequently used in the training corpus to reduce the computational costs and exclude noise. However, this vocabulary set may still include words that interfere with learning in encoder-decoder models. This paper proposes a method for selecting more suitable words for learning encoders by utilizing not only frequency, but also co-occurrence information, which we capture using the HITS algorithm. We apply our proposed method to two tasks: machine translation and grammatical error correction. For Japanese-to-English translation, this method achieves a BLEU score that is 0.56 points more than that of a baseline. It also outperforms the baseline method for English grammatical error correction, with an F0.5-measure that is 1.48 points higher.\n\nSo we do not use pre-trained embedding in this case?"}]}
{"question_id": "489", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Make shaped inserts for cakes"}]}
{"question_id": "492", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Hi"}]}
{"question_id": "500", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Modelling Semantic Categories using Conceptual Neighborhood\nAbstract: While many methods for learning vector space embeddings have been proposed in the field of Natural Language Processing, these methods typically do not distinguish between categories and individuals. Intuitively, if individuals are represented as vectors, we can think of categories as (soft) regions in the embedding space. Unfortunately, meaningful regions can be difficult to estimate, especially since we often have few examples of individuals that belong to a given category. To address this issue, we rely on the fact that different categories are often highly interdependent. In particular, categories often have conceptual neighbors, which are disjoint from but closely related to the given category (e.g.\\ fruit and vegetable). Our hypothesis is that more accurate category representations can be learned by relying on the assumption that the regions representing such conceptual neighbors should be adjacent in the embedding space. We propose a simple method for identifying conceptual neighbors and then show that incorporating these conceptual neighbors indeed leads to more accurate region based representations.\n\nWhat experiments they perform to demonstrate that their approach leads more accurate region based representations?"}]}
{"question_id": "502", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Context: Introduction\nAccurate language identification (LID) is the first step in many natural language processing and machine comprehension pipelines. If the language of a piece of text is known then the appropriate downstream models like parts of speech taggers and language models can be applied as required.\nLID is further also an important step in harvesting scarce language resources. Harvested data can be used to bootstrap more accurate LID models and in doing so continually improve the quality of the harvested data. Availability of data is still one of the big roadblocks for applying data driven approaches like supervised machine learning in developing countries.\nHaving 11 official languages of South Africa has lead to initiatives (discussed in the next section) that have had positive effect on the availability of language resources for research. However, many of the South African languages are still under resourced from the point of view of building data driven models for machine comprehension and process automation.\nTable TABREF2 shows the percentages of first language speakers for each of the official languages of South Africa. These are four conjunctively written Nguni languages (zul, xho, nbl, ssw), Afrikaans (afr) and English (eng), three disjunctively written Sotho languages (nso, sot, tsn), as well as tshiVenda (ven) and Xitsonga (tso). The Nguni languages are similar to each other and harder to distinguish. The same is true of the Sotho languages.\nThis paper presents a hierarchical naive Bayesian and lexicon based classifier for LID of short pieces of text of 15-20 characters long. The algorithm is evaluated against recent approaches using existing test sets from previous works on South African languages as well as the Discriminating between Similar Languages (DSL) 2015 and 2017 shared tasks.\nSection SECREF2 reviews existing works on the topic and summarises the remaining research problems. Section SECREF3 of the paper discusses the proposed algorithm and Section SECREF4 presents comparative results.\nRelated Works\nThe focus of this section is on recently published datasets and LID research applicable to the South African context. An in depth survey of algorithms, features, datasets, shared tasks and evaluation methods may be found in BIBREF0.\nThe datasets for the DSL 2015 & DSL 2017 shared tasks BIBREF1 are often used in LID benchmarks and also available on Kaggle . The DSL datasets, like other LID datasets, consists of text sentences labelled by language. The 2017 dataset, for example, contains 14 languages over 6 language groups with 18000 training samples and 1000 testing samples per language.\nThe recently published JW300 parallel corpus BIBREF2 covers over 300 languages with around 100 thousand parallel sentences per language pair on average. In South Africa, a multilingual corpus of academic texts produced by university students with different mother tongues is being developed BIBREF3. The WiLI-2018 benchmark dataset BIBREF4 for monolingual written natural language identification includes around 1000 paragraphs of 235 languages. A possibly useful link can also be made BIBREF5 between Native Language Identification (NLI) (determining the native language of the author of a text) and Language Variety Identification (LVI) (classification of different varieties of a single language) which opens up more datasets. The Leipzig Corpora Collection BIBREF6, the Universal Declaration of Human Rights and Tatoeba are also often used sources of data.\nThe NCHLT text corpora BIBREF7 is likely a good starting point for a shared LID task dataset for the South African languages BIBREF8. The NCHLT text corpora contains enough data to have 3500 training samples and 600 testing samples of 300+ character sentences per language. Researchers have recently started applying existing algorithms for tasks like neural machine translation in earnest to such South African language dataset\nQuestion: Which languages are similar to each other?"}]}
{"question_id": "510", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Smoking harms the body in many ways. It is most harmful to which organ?"}]}
{"question_id": "517", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What does it mean when a cell is permeable, does it have anything to do with what a cell is used for once its fully developed?"}]}
{"question_id": "527", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Which mixture can be easily separated by adding water and pouring it through a coffee filter?"}]}
{"question_id": "538", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "When a hammer strikes a nail, the nail"}]}
{"question_id": "539", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Translate \"You better call.\" to Czech?"}]}
{"question_id": "541", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To easily make pattern pieces for a cosplay vest."}]}
{"question_id": "551", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Context: Introduction\nCoronavirus disease 2019 (COVID-19) is an infectious disease that has affected more than one million individuals all over the world and caused more than 55,000 deaths, as of April 3 in 2020. The science community has been working very actively to understand this new disease and make diagnosis and treatment guidelines based on the findings. One major stream of efforts are focused on discovering the correlation between radiological findings in the lung areas and COVID-19. There have been several works BIBREF0, BIBREF1 publishing such results. However, existing studies are mostly conducted separately by different hospitals and medical institutes. Due to geographic affinity, the populations served by different hospitals have different genetic, social, and ethnic characteristics. As a result, the radiological findings from COVID-19 patient cases in different populations are different. This population bias incurs inconsistent or even conflicting conclusions regarding the correlation between radiological findings and COVID-19. As a result, medical professionals cannot make informed decisions on how to use radiological findings to guide diagnosis and treatment of COVID-19.\nWe aim to address this issue. Our research goal is to develop natural language processing methods to collectively analyze the study results reported by many hospitals and medical institutes all over the world, reconcile these results, and make a holistic and unbiased conclusion regarding the correlation between radiological findings and COVID-19. Specifically, we take the CORD-19 dataset BIBREF2, which contains over 45,000 scholarly articles, including over 33,000 with full text, about COVID-19, SARS-CoV-2, and related coronaviruses. We develop sentence classification methods to identify all sentences narrating radiological findings from COVID-19. Then constituent parsing is utilized to identify all noun phrases from these sentences and these noun phrases contain abnormalities, lesions, diseases identified by radiology imaging such as X-ray and computed tomography (CT). We calculate the frequency of these noun phrases and select those with top frequencies for medical professionals to further investigate. Since these clinical entities are aggregated from a number of hospitals all over the world, the population bias is largely mitigated and the conclusions are more objective and universally informative. From the CORD-19 dataset, our method successfully discovers a set of clinical findings that are closely related with COVID-19.\nThe major contributions of this paper include:\nWe develop natural language processing methods to perform unbiased study of the correlation between radiological findings and COVID-19.\nWe develop a bootstrapping approach to effectively train a sentence classifier with light-weight manual annotation effort. The sentence classifier is used to extract radiological findings from a vast amount of literature.\nWe conduct experiments to verify the effectiveness of our method. From the CORD-19 dataset, our method successfully discovers a set of clinical findings that are closely related with COVID-19.\nThe rest of the paper is organized as follows. In Section 2, we introduce the data. Section 3 presents the method. Section 4 gives experimental results. Section 5 concludes the paper.\nDataset\nWe used the COVID-19 Open Research Dataset (CORD-19) BIBREF2 for our study. In response to the COVID-19 pandemic, the White House and a coalition of research groups prepared the CORD-19 dataset. It contains over 45,000 scholarly articles, including over 33,000 with full text, about COVID-19, SARS-CoV-2, and related coronaviruses. These articles are contributed by hospitals and medical institutes all over the world. Since the outbreak of COVID-19 is after November 2019, we select articles published after November 2019 to study, which include a total of 2081 articles and about 360000 sente\nQuestion: How large is the collection of COVID-19 literature?"}]}
{"question_id": "553", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Como agregar un nuevo control a mi Fire Stick"}]}
{"question_id": "559", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to make an easy dressing for fruit salad"}]}
{"question_id": "567", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to fill a cupcake"}]}
{"question_id": "569", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "to give silver jewelry and accessories some shine"}]}
{"question_id": "588", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "redis是什么"}]}
{"question_id": "594", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How do I keep the contents of a cooler cool without using ice?"}]}
{"question_id": "596", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "In 1976, the Viking I Lander was sent to Mars to analyze atmospheric gases and soil samples. The Viking I Lander was most likely a"}]}
{"question_id": "599", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Measuring the Reliability of Hate Speech Annotations: The Case of the European Refugee Crisis\nAbstract: Some users of social media are spreading racist, sexist, and otherwise hateful content. For the purpose of training a hate speech detection system, the reliability of the annotations is crucial, but there is no universally agreed-upon definition. We collected potentially hateful messages and asked two groups of internet users to determine whether they were hate speech or not, whether they should be banned or not and to rate their degree of offensiveness. One of the groups was shown a definition prior to completing the survey. We aimed to assess whether hate speech can be annotated reliably, and the extent to which existing definitions are in accordance with subjective ratings. Our results indicate that showing users a definition caused them to partially align their own opinion with the definition but did not improve reliability, which was very low overall. We conclude that the presence of hate speech should perhaps not be considered a binary yes-or-no decision, and raters need more detailed instructions for the annotation.\n\nHow was reliability measured?"}]}
{"question_id": "603", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Measurement for a Paracord Ring"}]}
{"question_id": "613", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "The fur color of a bear varies with its environment. Polar bears found in the Arctic have white fur, while black bears found in Pennsylvania have dark fur. Which best describes the variation of fur color amongst the bear species?"}]}
{"question_id": "629", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Dalmatian dogs sometimes become deaf due to a recessive trait they may inherit. For this reason, some Dalmatian owners will not let their dogs have puppies if they are deaf. Allowing only Dalmatians that can hear to produce offspring is an example of"}]}
{"question_id": "633", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Translate \"exploit the very interconnectedness and openness so essential to our prosperity; and challenges in a global marketplace which links the derivative trader on Wall Street to the homeowner on Main Street, the office worker in America to the factory worker in China -- a marketplace in which we all share in opportunity, but also in crisis.\" to Russian?"}]}
{"question_id": "634", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How to reuse an ink pen if the ink runs out?"}]}
{"question_id": "641", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "how to calculate macros"}]}
{"question_id": "643", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To mix flour and salt so that it becomes fluffy and fine, you can"}]}
{"question_id": "648", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To make a cheap terrarium for gecko."}]}
{"question_id": "662", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Explanation for the following question's answer: Teachers do not assign houseworks, they assign homework.\nQuestion: Which of the following sentences is nonsensical?\nOptions:\n- Sentence A: \"teachers assign homework to the students\"\n- Sentence B: \"teachers assign housework to the students\"\n\nAnswer: Sentence B\n\nExplanation for the following question's answer: Kerosene is flammable and would make the fire grow.\nQuestion: Choose the sentence that goes against common sense.\nOptions:\n- Sentence A: \"they put out a fire successfully with kerosene\"\n- Sentence B: \"they put out a fire successfully with water\"\n\nAnswer: Sentence A\n\nExplanation for the following question's answer: February only has 28 days or 29 days.\nQuestion: One of the following sentences is nonsensical. Which one is it?\nOptions:\n- Sentence A: \"Today is April 30th.\"\n- Sentence B: \"Today is February 30th.\"\n\nAnswer: Sentence B\n\nExplanation for the following question's answer: A person is not able to eat a car."}]}
{"question_id": "668", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Avoid motion sickness on a boat."}]}
{"question_id": "670", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How can I make my margarita more sour?"}]}
{"question_id": "683", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Make sure all the pieces of your leather-working project match up for assembly."}]}
{"question_id": "693", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to hold a match for a fading flame"}]}
{"question_id": "697", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Part 1. Definition\nGiven a sentence in Igbo language, translate the sentence to English language keeping the meaning of the original sentence intact\nPart 2. Example\nIgbo sentence: Olee kwere omume?\nAnswer: How is this possible\nExplanation: The English translation means the same as the original sentence in the Igbo language.\nPart 3. Exercise\nIgbo sentence: Nke a na-eme ka ọnụ ụlọ dị ala ruo 1.35%, nke dị na egwuregwu dị ka craps na baccarat .\nAnswer:"}]}
{"question_id": "698", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "what is the currency in Hong Kong china"}]}
{"question_id": "699", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Make a hacky sack."}]}
{"question_id": "700", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Local Contextual Attention with Hierarchical Structure for Dialogue Act Recognition\nAbstract: Dialogue act recognition is a fundamental task for an intelligent dialogue system. Previous work models the whole dialog to predict dialog acts, which may bring the noise from unrelated sentences. In this work, we design a hierarchical model based on self-attention to capture intra-sentence and inter-sentence information. We revise the attention distribution to focus on the local and contextual semantic information by incorporating the relative position information between utterances. Based on the found that the length of dialog affects the performance, we introduce a new dialog segmentation mechanism to analyze the effect of dialog length and context padding length under online and offline settings. The experiment shows that our method achieves promising performance on two datasets: Switchboard Dialogue Act and DailyDialog with the accuracy of 80.34\\% and 85.81\\% respectively. Visualization of the attention weights shows that our method can learn the context dependency between utterances explicitly.\n\nWhat previous methods is the proposed method compared against?"}]}
{"question_id": "701", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to slice bread"}]}
{"question_id": "705", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Erin placed her shamrock plant in a dark corner. Soon she saw that the leaves had tilted toward her window. What did the plant need most from the window?"}]}
{"question_id": "709", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Was the Miranda warning first established in 1966 by the US Supreme Court?"}]}
{"question_id": "710", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To extend the shelf life of lettuce,"}]}
{"question_id": "711", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "The task is to read a passage and convert numbers in their text forms into digit forms. The text numbers can be used to represent Quantity, Dates and Time, Addresses or Positions.\nOne example is below.\nQ: Jacob ate three burgers today.\nA: Jacob ate 3 burgers today.\nRationale: The number in text form three is converted into the number in digit form 3.\nQ: Early in the evening of November twenty two,\nA:"}]}
{"question_id": "718", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "to empty the dirt out of your dirt devil"}]}
{"question_id": "719", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To keep meatballs from falling apart when cooking them,"}]}
{"question_id": "720", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "What are some nearby towns near Chimborazo and what is the climbing difficulty level of Chimborazo?"}]}
{"question_id": "722", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Create back rest for sink repair."}]}
{"question_id": "724", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "How to kill a wasp's nest"}]}
{"question_id": "752", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Brazilian Lyrics-Based Music Genre Classification Using a BLSTM Network\nAbstract: Organize songs, albums, and artists in groups with shared similarity could be done with the help of genre labels. In this paper, we present a novel approach for automatic classifying musical genre in Brazilian music using only the song lyrics. This kind of classification remains a challenge in the field of Natural Language Processing. We construct a dataset of 138,368 Brazilian song lyrics distributed in 14 genres. We apply SVM, Random Forest and a Bidirectional Long Short-Term Memory (BLSTM) network combined with different word embeddings techniques to address this classification task. Our experiments show that the BLSTM method outperforms the other models with an F1-score average of $0.48$. Some genres like\"gospel\",\"funk-carioca\"and\"sertanejo\", which obtained 0.89, 0.70 and 0.69 of F1-score, respectively, can be defined as the most distinct and easy to classify in the Brazilian musical genres context.\n\nwhat genre was the most difficult to classify?"}]}
{"question_id": "757", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "how do you cast a fishing line?"}]}
{"question_id": "762", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to create more counter space"}]}
{"question_id": "766", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "How to teach a child to draw letters?"}]}
{"question_id": "785", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "when did the drinking age change to 19 in Wisconsin"}]}
{"question_id": "789", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "mein hund ich neine schon, was soll ich tun um es zu beheben"}]}
{"question_id": "791", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How does the level of spiciness of Kung Pao Chicken compare to Mapo Tofu?"}]}
{"question_id": "792", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "To make a curved surface using a flat EVA foam sheet."}]}
{"question_id": "793", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Embracing data abundance: BookTest Dataset for Reading Comprehension\nAbstract: There is a practically unlimited amount of natural language data available. Still, recent work in text comprehension has focused on datasets which are small relative to current computing possibilities. This article is making a case for the community to move to larger data and as a step in that direction it is proposing the BookTest, a new dataset similar to the popular Children's Book Test (CBT), however more than 60 times larger. We show that training on the new data improves the accuracy of our Attention-Sum Reader model on the original CBT test data by a much larger margin than many recent attempts to improve the model architecture. On one version of the dataset our ensemble even exceeds the human baseline provided by Facebook. We then show in our own human study that there is still space for further improvement.\n\nHow do they show there is space for further improvement?"}]}
{"question_id": "796", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Teacher:In this task, you are given a sentence or phrase in English. You must translate it to Xhosa in a way that is equivalent in terms of meaning and grammatically correct.\nTeacher: Now, understand the problem? Solve this instance: It has a wire boltrope, served with spunyarn or nettlestuff.\nStudent:"}]}
{"question_id": "804", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Increase softness of lips."}]}
{"question_id": "808", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "One wishes to have a multi-functioned belt."}]}
{"question_id": "809", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Make your own applesauce."}]}
{"question_id": "812", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Which is most likely a direct cause of an ear infection?"}]}
{"question_id": "820", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "¿En qué posición va el Chelsea en la Premier League?"}]}
{"question_id": "821", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "what country has the largest economy in africa"}]}
{"question_id": "831", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to start seeds for cheap"}]}
{"question_id": "833", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "what is the best streaming movie service"}]}
{"question_id": "835", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "How do I uninstall McAffe and reenable Windows Defender?"}]}
{"question_id": "845", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What is the most reasonable explanation for why a toy car rolls farther on a wood floor than on a thick carpet?"}]}
{"question_id": "853", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "When do we vote for governor in the state encompassing Picket Fences?"}]}
{"question_id": "863", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Detecting\"Smart\"Spammers On Social Network: A Topic Model Approach\nAbstract: Spammer detection on social network is a challenging problem. The rigid anti-spam rules have resulted in emergence of\"smart\"spammers. They resemble legitimate users who are difficult to identify. In this paper, we present a novel spammer classification approach based on Latent Dirichlet Allocation(LDA), a topic model. Our approach extracts both the local and the global information of topic distribution patterns, which capture the essence of spamming. Tested on one benchmark dataset and one self-collected dataset, our proposed method outperforms other state-of-the-art methods in terms of averaged F1-score.\n\nLDA is an unsupervised method; is this paper introducing an unsupervised approach to spam detection?"}]}
{"question_id": "867", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "To disassemble a computer,"}]}
{"question_id": "877", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to create a mini first aid kit"}]}
{"question_id": "881", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "how do you scale a building?"}]}
{"question_id": "883", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How do you care for Tulips after they bloom?"}]}
{"question_id": "885", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Did Thomas Edison invent anything significant?"}]}
{"question_id": "896", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How can I get my cat to start using her litter box more?"}]}
{"question_id": "897", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "What is the difference in type of food served by Shake Shack and InNOut Burger?"}]}
{"question_id": "898", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How do you prepare for a destination city in your study abroad?"}]}
{"question_id": "899", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Make a cheap hot tub."}]}
{"question_id": "904", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Which of the following is most likely to make a rock crack and crumble?"}]}
{"question_id": "907", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "make squash baby food"}]}
{"question_id": "912", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "To give control over how bright a light is."}]}
{"question_id": "917", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Text: the republican party of texas will donate proceeds from a vendor who sold a racist campaign button at the state convention last weekend to midwestern flood victims , a party spokesman said wednesday .\n\nSummary: texas republicans to donate proceeds from vendor of racist button to flood victims\n\nGenerate a short summary: yao ming has a stress fracture in his left ankle and the houston rockets said there is no timetable for the return of the towering chinese center whose nba career may be in serious jeopardy after a series of injuries .\nAnswer: yao has stress fracture in ankle\n\nthe indian government decided monday to extend federal rule over kashmir by six months after the election chief said polls could not be held by mid-july , when the latest term of central rule expires .\n\nShort summary: india extends federal rule in kashmir but says polls will be held\n\nIN: there are three basic ways to drive a mini cooper , each pleasurable .\nsummary: there 's more than meets the eye\n\nProblem: international donors plan to send an assessment team to southeastern and southern ethiopia where the regional government has declared a state of emergency because of drought , an aid official said friday .\n\nWhat is a very short summary of the above text?\n++++++++++\nA: international donors to assess needs of drought-stricken region\n\nText: the sponsors of a large international study have called a halt to the project because patients on experimental therapy were doing so much better that it was unethical to withhold it from other study subjects .\n\nSummary:"}]}
{"question_id": "933", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Use stream of consciousness to answer the following. On January 1, 1835, president Andrew Jackson paid off the entire national debt, the only time in U.S. history that has been accomplished.\n\nAnswer this question based on the passage: when was the last time the us had no federal deficit?"}]}
{"question_id": "934", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "where is the ark that was built in Kentucky"}]}
{"question_id": "936", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Are eagles and young bears both used as labels for skills-training youth groups?\nChain of thought:"}]}
{"question_id": "943", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Crows are found throughout many parts of the world. They are black birds with excellent hearing. In the wild they live for six to seven years. Some crows in Japan open hard-shelled nuts by dropping them in front of moving cars. Which of these is a learned behavior?"}]}
{"question_id": "945", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "In addition to oxygen, which gases make up the largest percentage of Earth's atmosphere?"}]}
{"question_id": "960", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Is safety a top priority in the assembly line process?"}]}
{"question_id": "961", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Freshen up tired eyes."}]}
{"question_id": "989", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Given the stream of consciousness rationale, provide a reasonable question and answer. Rationale: Friends get together at each other's house for games and even bring food. friends house is a place where one can bring food for game.\n The question and answer:"}]}
{"question_id": "995", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Avoid late night food cravings."}]}
{"question_id": "999", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Me ofereça por favor dez sugestões de nome para meu canal no YouTube sobre como criar peixes de oceano em aquários domésticos."}]}
{"question_id": "1021", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Alice travels away from a point at a speed of 5 mph.  How many miles will she have traveled in one hour?"}]}
{"question_id": "1022", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: SimplerVoice: A Key Message&Visual Description Generator System for Illiteracy\nAbstract: We introduce SimplerVoice: a key message and visual description generator system to help low-literate adults navigate the information-dense world with confidence, on their own. SimplerVoice can automatically generate sensible sentences describing an unknown object, extract semantic meanings of the object usage in the form of a query string, then, represent the string as multiple types of visual guidance (pictures, pictographs, etc.). We demonstrate SimplerVoice system in a case study of generating grocery products' manuals through a mobile application. To evaluate, we conducted a user study on SimplerVoice's generated description in comparison to the information interpreted by users from other methods: the original product package and search engines' top result, in which SimplerVoice achieved the highest performance score: 4.82 on 5-point mean opinion score scale. Our result shows that SimplerVoice is able to provide low-literate end-users with simple yet informative components to help them understand how to use the grocery products, and that the system may potentially provide benefits in other real-world use cases\n\nDoes their solution involve connecting images and text?"}]}
{"question_id": "1027", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How can I keep my tupperware and other light items from flipping over in the dishwasher?"}]}
{"question_id": "1034", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "How many households were there in the city in which WPUR is licensed?"}]}
{"question_id": "1048", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Characterizing Diabetes, Diet, Exercise, and Obesity Comments on Twitter\nAbstract: Social media provide a platform for users to express their opinions and share information. Understanding public health opinions on social media, such as Twitter, offers a unique approach to characterizing common health issues such as diabetes, diet, exercise, and obesity (DDEO), however, collecting and analyzing a large scale conversational public health data set is a challenging research task. The goal of this research is to analyze the characteristics of the general public's opinions in regard to diabetes, diet, exercise and obesity (DDEO) as expressed on Twitter. A multi-component semantic and linguistic framework was developed to collect Twitter data, discover topics of interest about DDEO, and analyze the topics. From the extracted 4.5 million tweets, 8% of tweets discussed diabetes, 23.7% diet, 16.6% exercise, and 51.7% obesity. The strongest correlation among the topics was determined between exercise and obesity. Other notable correlations were: diabetes and obesity, and diet and obesity DDEO terms were also identified as subtopics of each of the DDEO topics. The frequent subtopics discussed along with Diabetes, excluding the DDEO terms themselves, were blood pressure, heart attack, yoga, and Alzheimer. The non-DDEO subtopics for Diet included vegetarian, pregnancy, celebrities, weight loss, religious, and mental health, while subtopics for Exercise included computer games, brain, fitness, and daily plan. Non-DDEO subtopics for Obesity included Alzheimer, cancer, and children. With 2.67 billion social media users in 2016, publicly available data such as Twitter posts can be utilized to support clinical providers, public health experts, and social scientists in better understanding common public opinions in regard to diabetes, diet, exercise, and obesity.\n\nHow were topics of interest about DDEO identified?"}]}
{"question_id": "1053", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "In order to make a line graph showing the rate of erosion on the banks of a river during a week-long flood, the y-axis should be labeled as the width of the river bank, in meters. The best label for the x-axis is time, in"}]}
{"question_id": "1055", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: FacTweet: Profiling Fake News Twitter Accounts\nAbstract: We present an approach to detect fake news in Twitter at the account level using a neural recurrent model and a variety of different semantic and stylistic features. Our method extracts a set of features from the timelines of news Twitter accounts by reading their posts as chunks, rather than dealing with each tweet independently. We show the experimental benefits of modeling latent stylistic signatures of mixed fake and real news with a sequential model over a wide range of strong baselines.\n\nWhat baselines do they compare to?"}]}
{"question_id": "1061", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Heal sore throat."}]}
{"question_id": "1078", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "instruction:\nGiven a sentence in French, generate a new French sentence by performing small changes on the sentence. Here, make sure that the changes are semantically related and syntactically similar to the input. And the generated sentence should have high commonsense plausibility, that is to have reasonable probability of it being true.\nquestion:\nUne classe est utilisée pour la discussion et les étudiants.\nanswer:\nUne salle de classe est utilisée pour les enseignants et les élèves.\n\n\nquestion:\nLes nouveau-nés ont perdu de l'aide de leur tante pour survivre.\nanswer:\nLes nouveau-nés ont besoin de l'aide de leur mère pour survivre.\n\n\nquestion:\nVous pouvez dessiner des sons à travers une radio.\nanswer:"}]}
{"question_id": "1083", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How can you keep babies from crying when you pick them up?"}]}
{"question_id": "1087", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: On Evaluating the Generalization of LSTM Models in Formal Languages\nAbstract: Recurrent Neural Networks (RNNs) are theoretically Turing-complete and established themselves as a dominant model for language processing. Yet, there still remains an uncertainty regarding their language learning capabilities. In this paper, we empirically evaluate the inductive learning capabilities of Long Short-Term Memory networks, a popular extension of simple RNNs, to learn simple formal languages, in particular $a^nb^n$, $a^nb^nc^n$, and $a^nb^nc^nd^n$. We investigate the influence of various aspects of learning, such as training data regimes and model capacity, on the generalization to unobserved samples. We find striking differences in model performances under different training settings and highlight the need for careful analysis and assessment when making claims about the learning capabilities of neural network models.\n\nWhat training settings did they try?"}]}
{"question_id": "1089", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Nenne mir eine sehr bekannte Straße im Rotlichtviertel in Hamburg."}]}
{"question_id": "1106", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Butter too hard to spread?"}]}
{"question_id": "1109", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Given a sentence in English language, translate the sentence to Igbo language keeping the meaning of the original sentence intact\n\nEnglish sentence: Moreover the man Moses was very great in the land of Egypt, in the sight of Pharaoh's servants, and in the sight of the people."}]}
{"question_id": "1115", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Sentiment Analysis of Citations Using Word2vec\nAbstract: Citation sentiment analysis is an important task in scientific paper analysis. Existing machine learning techniques for citation sentiment analysis are focusing on labor-intensive feature engineering, which requires large annotated corpus. As an automatic feature extraction tool, word2vec has been successfully applied to sentiment analysis of short texts. In this work, I conducted empirical research with the question: how well does word2vec work on the sentiment analysis of citations? The proposed method constructed sentence vectors (sent2vec) by averaging the word embeddings, which were learned from Anthology Collections (ACL-Embeddings). I also investigated polarity-specific word embeddings (PS-Embeddings) for classifying positive and negative citations. The sentence vectors formed a feature space, to which the examined citation sentence was mapped to. Those features were input into classifiers (support vector machines) for supervised classification. Using 10-cross-validation scheme, evaluation was conducted on a set of annotated citations. The results showed that word embeddings are effective on classifying positive and negative citations. However, hand-crafted features performed better for the overall classification.\n\nWhat dataset is used?"}]}
{"question_id": "1120", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "J'aimerais que tu me donnes des citations intelligentes et inspirantes pour pouvoir briller lors du dîner que j'ai vendredi prochain avec les parents de ma copine."}]}
{"question_id": "1126", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Which two activities use most of the water used in an average U.S. household?"}]}
{"question_id": "1131", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Згенеруй пароль з заданими характеристиками:\n1. Довжина більша ніж 10 символів.\n2. Має бути один чи більше спецсимволів (#,$,%,_,!) (кома також можлива).\n3. Краще фраза."}]}
{"question_id": "1134", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Choosing the right whole grains for a healthy diet"}]}
{"question_id": "1138", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to serve turkey that has gone cold?"}]}
{"question_id": "1140", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "how long does an American football match REALLY last, if you substract all the downtime?"}]}
{"question_id": "1143", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How to ensure airflow through a window?"}]}
{"question_id": "1147", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Where does the Monsoon typically occur?"}]}
{"question_id": "1151", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Improving Information Retrieval Results for Persian Documents using FarsNet\nAbstract: In this paper, we propose a new method for query expansion, which uses FarsNet (Persian WordNet) to find similar tokens related to the query and expand the semantic meaning of the query. For this purpose, we use synonymy relations in FarsNet and extract the related synonyms to query words. This algorithm is used to enhance information retrieval systems and improve search results. The overall evaluation of this system in comparison to the baseline method (without using query expansion) shows an improvement of about 9 percent in Mean Average Precision (MAP).\n\nWhich evaluation metric has been measured?"}]}
{"question_id": "1156", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To make an effective homemade cough syrup,"}]}
{"question_id": "1164", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Neural Machine Translation with Supervised Attention\nAbstract: The attention mechanisim is appealing for neural machine translation, since it is able to dynam- ically encode a source sentence by generating a alignment between a target word and source words. Unfortunately, it has been proved to be worse than conventional alignment models in aligment accuracy. In this paper, we analyze and explain this issue from the point view of re- ordering, and propose a supervised attention which is learned with guidance from conventional alignment models. Experiments on two Chinese-to-English translation tasks show that the super- vised attention mechanism yields better alignments leading to substantial gains over the standard attention based NMT.\n\nWhich conventional alignment models do they use as guidance?"}]}
{"question_id": "1168", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Title: Good moisturizer Product review: I have combination skin and feel like this moisturizer is a tad on the rich side, so i prefer to use it at night, or a dab anytime on any dry spots, especially around the lips. However, after undergoing heavy skin exfoliation treatments, this product can still cause some minor irritation. Even so, it is very useful for general use and i will probably purchase it again, i feel like i got a good volume of good product for a decent price. Would you say this review depicts the product in a flattering or unflattering light?\nflattering\n------\nTitle: Did NOT work for us... Product review: Unfortunately, this product did NOT work at all for our family. We installed the Catstop outside our home and the cats immediately went right up to it. We could slightly hear the \"ultrasonic sound\", which wasn't bad... but apparently it did not affect the cats. We will be returning this item immediately. Would you say this review depicts the product in a flattering or unflattering light?\nunflattering\n------\nTitle: useful book for Analysis Product review: This book assisted me in my graduate classes for Kinesiology.I recommend it for any graduate students who need to take similar classes to mine. Would you say this review depicts the product in a flattering or unflattering light?\nflattering\n------\nTitle: OMGGGGGGGGGGGGGG Product review: This product absolutely sucks. It's flimsy and not well designed. My wife just laughed at it when i installed it and refuses to go near it because it looks like it will just fall off the wall. A total waste of cash..... Would you say this review depicts the product in a flattering or unflattering light?"}]}
{"question_id": "1170", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "To prevent your cell phone from ringing during a meeting,"}]}
{"question_id": "1176", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Which tool would best separate sand and clay mixed in soil?"}]}
{"question_id": "1179", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To test if household batteries are still good,"}]}
{"question_id": "1180", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Are the reviews for Sunday Brunch mostly positive and is the price range affordable?"}]}
{"question_id": "1181", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Does the Labour Party have a specific ideology?"}]}
{"question_id": "1182", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "미국의 국채는 얼마인가요?"}]}
{"question_id": "1183", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Rapid Classification of Crisis-Related Data on Social Networks using Convolutional Neural Networks\nAbstract: The role of social media, in particular microblogging platforms such as Twitter, as a conduit for actionable and tactical information during disasters is increasingly acknowledged. However, time-critical analysis of big crisis data on social media streams brings challenges to machine learning techniques, especially the ones that use supervised learning. The Scarcity of labeled data, particularly in the early hours of a crisis, delays the machine learning process. The current state-of-the-art classification methods require a significant amount of labeled data specific to a particular event for training plus a lot of feature engineering to achieve best results. In this work, we introduce neural network based classification methods for binary and multi-class tweet classification task. We show that neural network based models do not require any feature engineering and perform better than state-of-the-art methods. In the early hours of a disaster when no labeled data is available, our proposed method makes the best use of the out-of-event data and achieves good results.\n\nwhat was their baseline comparison?"}]}
{"question_id": "1186", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How To make Vanilla Creme Brulee"}]}
{"question_id": "1189", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Repair DVD scratches."}]}
{"question_id": "1190", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "The use of the Internet has changed life for many people by directly allowing them to"}]}
{"question_id": "1199", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "You are given an original reference as well as a system reference. Your task is to judge the quality of the system reference. If the utterance is grammatically correct and fluent output 1, else output 0.\nOne example is below.\nQ: System Reference: there is a chinese restaurant on x called x.\nOriginal Reference: x is a chinese restaurant in x.\nA: 1\nRationale: The system reference is grammatically correct and fluent.\nQ: System Reference: shangri la vegetarian restaurant is in hayes valley or golden gate park and the phone number is 4157312548.\nOriginal Reference: sure, the phone number to shangri la vegetarian restaurant is 4157312548 and the restaurant has too location -s in hayes valley and golden gate park.\nA:"}]}
{"question_id": "1202", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "What is the theme music and who are the announcers for Monday Night Football?"}]}
{"question_id": "1216", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Protect fragile plates during move."}]}
{"question_id": "1218", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Remove a label from a jar in a non toxic way"}]}
{"question_id": "1219", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "To make a U shaped toilet seat more comfortable,"}]}
{"question_id": "1220", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Are you nervous about giving a speech or doing something?  How can you calm yourself?"}]}
{"question_id": "1236", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Planting legumes in order to add nitrogen to soil most likely causes"}]}
{"question_id": "1246", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Do Heathrow Airport and Changi Airport have the same number of runways?"}]}
{"question_id": "1247", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "A particular organism is able to survive in an environment due to a thick layer of fat beneath its skin. In which situation would the layer of fat most likely be a survival advantage?"}]}
{"question_id": "1254", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "パウンドケーキを焼いてみたら石のように硬くなってしまいました。包丁をあて、金槌で叩かないと切ることもままなりません。\n一体何が悪かったのでしょうか。次失敗しないためにどうすればいいか教えてください。"}]}
{"question_id": "1257", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To test baking soda to make sure it's still good."}]}
{"question_id": "1260", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What can a moving magnet in a coil of copper wire cause?"}]}
{"question_id": "1274", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "To re-wire your brain to be happy"}]}
{"question_id": "1277", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Zrób mi plan na produktywny dzień. Jestem uczniem liceum 2 klasy."}]}
{"question_id": "1283", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Radio signal interruption sometimes causes a humming or buzzing sound. These sounds are most likely caused by"}]}
{"question_id": "1300", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Instructions: You are given a question title. You need to classify it into one of the 10 topics: 0 - 'Society & Culture', 1 - 'Science & Mathematics', 2 - 'Health', 3 - 'Education & Reference', 4 - 'Computers & Internet', 5 - 'Sports', 6 - 'Business & Finance', 7 - 'Entertainment & Music', 8 - 'Family & Relationships', 9 - 'Politics & Government'.\nInput: Which soccer team has won the most European club championships?\nOutput:"}]}
{"question_id": "1301", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "What is the best heading/title for a resume?"}]}
{"question_id": "1326", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "In this task, you are given dialogue, and you have to find the most critical location in the given conversation.\nQ: I would like to know about Kochi, more specifically the transport. \n Ill be happy to help. The Kochi metro is a metro rapid system serving the city of Kochi. It is intended to ease traffic congestion. \n Does it extend to other cities? \n Apparently, Kochi metro is operational from Aluva till Majara. \n Thank you, that is very helpful. Does Kochi have social service organisations? \n Im sorry, i dont have that information but did you know the Federal Bank , the fourth largest bank in India is located in Aluva, which is a suburb of Kochi \n That is interesting, do you have any other useful facts about Kochi? \n Yes! The remaining part of Kochi were governed by governors of Kochi Kingdom. \n Neat. I am looking more specifically for ways to get around the city. Do you have any other facts about that? \n Of course, the Cochin Airport provides direct connectivity to popular international destinations in the Middle East, Malaysia, Thailand and Singapore and to most major Indian cities. \n Great, that makes it easier to get there! Thank you for all of the help! \n I agree. You are very welcome.\nA:"}]}
{"question_id": "1337", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Community Identity and User Engagement in a Multi-Community Landscape\nAbstract: A community's identity defines and shapes its internal dynamics. Our current understanding of this interplay is mostly limited to glimpses gathered from isolated studies of individual communities. In this work we provide a systematic exploration of the nature of this relation across a wide variety of online communities. To this end we introduce a quantitative, language-based typology reflecting two key aspects of a community's identity: how distinctive, and how temporally dynamic it is. By mapping almost 300 Reddit communities into the landscape induced by this typology, we reveal regularities in how patterns of user engagement vary with the characteristics of a community. Our results suggest that the way new and existing users engage with a community depends strongly and systematically on the nature of the collective identity it fosters, in ways that are highly consequential to community maintainers. For example, communities with distinctive and highly dynamic identities are more likely to retain their users. However, such niche communities also exhibit much larger acculturation gaps between existing users and newcomers, which potentially hinder the integration of the latter. More generally, our methodology reveals differences in how various social phenomena manifest across communities, and shows that structuring the multi-community landscape can lead to a better understanding of the systematic nature of this diversity.\n\nWhat patterns do they observe about how user engagement varies with the characteristics of a community?"}]}
{"question_id": "1341", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "I'm currently on the phone with a customer support representative with my ISP. I want to get the support rep to upgrade my internet speeds for less than the listed price on the ISPs website. What should I say to them?"}]}
{"question_id": "1343", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How long should I workout each day"}]}
{"question_id": "1344", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Leg cramps is caused when we are dehydrated. While running we get leg cramps .\nThis justifies what answer for what question? Q & A:"}]}
{"question_id": "1349", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "You are given a paper:\nTitle: Torch-Struct: Deep Structured Prediction Library\nAbstract: The literature on structured prediction for NLP describes a rich collection of distributions and algorithms over sequences, segmentations, alignments, and trees; however, these algorithms are difficult to utilize in deep learning frameworks. We introduce Torch-Struct, a library for structured prediction designed to take advantage of and integrate with vectorized, auto-differentiation based frameworks. Torch-Struct includes a broad collection of probabilistic structures accessed through a simple and flexible distribution-based API that connects to any deep learning model. The library utilizes batched, vectorized operations and exploits auto-differentiation to produce readable, fast, and testable code. Internally, we also include a number of general-purpose optimizations to provide cross-algorithm efficiency. Experiments show significant performance gains over fast baselines and case-studies demonstrate the benefits of the library. Torch-Struct is available at this https URL.\n\nIs this library implemented into Torch or is framework agnostic?"}]}
{"question_id": "1352", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "To remove ink from the sterilized cans,"}]}
{"question_id": "1356", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "What is the depth of the Suez Canal?"}]}
{"question_id": "1358", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to cook fresh pasta"}]}
{"question_id": "1380", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Where can I find a stapler in many places?\nOptions:\n- desk drawer\n- office building\n- manual\n- office supply store\n- desktop\nLet's think now! Step-by-step reasoning:"}]}
{"question_id": "1401", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "After staining wood, you should"}]}
{"question_id": "1416", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "I would like to start contributing to open source projects with Artificial Intelligence / Data Science themes. I currently have 2 years of experience in this field. Is my experience enough to start contributing to a project such as LAION Open Assistant or should I have more experience?"}]}
{"question_id": "1417", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: To lemmatize or not to lemmatize: how word normalisation affects ELMo performance in word sense disambiguation\nAbstract: We critically evaluate the widespread assumption that deep learning NLP models do not require lemmatized input. To test this, we trained versions of contextualised word embedding ELMo models on raw tokenized corpora and on the corpora with word tokens replaced by their lemmas. Then, these models were evaluated on the word sense disambiguation task. This was done for the English and Russian languages.  ::: The experiments showed that while lemmatization is indeed not necessary for English, the situation is different for Russian. It seems that for rich-morphology languages, using lemmatized training and testing data yields small but consistent improvements: at least for word sense disambiguation. This means that the decisions about text pre-processing before training ELMo should consider the linguistic nature of the language in question.\n\nWhy is lemmatization not necessary in English?"}]}
{"question_id": "1419", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Which tool is used to determine how long it takes warm water to melt an ice cube?"}]}
{"question_id": "1423", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "One of the functions of a topographic map is to"}]}
{"question_id": "1428", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Which could be a possible way to prevent wildlife species from becoming endangered?"}]}
{"question_id": "1431", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "In this task, you are given a hypothesis and an update. The hypothesis sentence is a statement that speaks of a socially normative behavior. In other words, it is a generalizing statement about how we expect people to behave in society. The update provides additional contexts about the situation that might UNDERMINE or SUPPORT the generalization. An undermining context provides a situation that weakens the hypothesis. A supporting context provides a situation that strengthens the generalization. Your task is to output 'strengthener' or 'weakener' if the update supports or undermines the hypothesis, respectively\nExample: Hypothesis: You should help your family with funeral expenses.\nUpdate: They have asked you to chip in\nExample solution: strengthener\nExample explanation: If your family has asked you to chip in for the funeral expenses, you should help them.\n\nProblem: Hypothesis: It's rude to not take a friend to the ER.\nUpdate: they're faking an injury"}]}
{"question_id": "1433", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What determines how long the Moon takes to complete one cycle of phases?"}]}
{"question_id": "1437", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Prepare a wall to have a frameless mirror attached"}]}
{"question_id": "1439", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "how do you turn on an iphone?"}]}
{"question_id": "1448", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "replace worn roof shingle"}]}
{"question_id": "1460", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "repel flies"}]}
{"question_id": "1462", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Was ist der Unterschied zwischen Backstahl und Pizzastein? Was davon sollte ich für Brötchen verwenden?"}]}
{"question_id": "1464", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Are self car washes open 24 hours?"}]}
{"question_id": "1482", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How can I attach tomato plants to stakes in the garden?"}]}
{"question_id": "1485", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Remove grease from your frying pans"}]}
{"question_id": "1488", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To prevent the nutella cookies from sticking to the baking sheet"}]}
{"question_id": "1494", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "When was gay marriage made legal in the place where Universidad Tecnologica is located?"}]}
{"question_id": "1501", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How can I detect hard to find nails embedded in wood?"}]}
{"question_id": "1502", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What is Saccharomyces cerevisiae commonly used for?"}]}
{"question_id": "1520", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Do the Bookmobile and Portable Library have the same number of books available for people to access?"}]}
{"question_id": "1522", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Some text: Le BSCI a constaté que l'évaluation de l'élément militaire d'un certain nombre de missions réalisée récemment par le Département s'était révélée utile.\n\nTranslate to English.\nTranslation: OIOS noted that the Department's recent evaluations of the military components in missions were useful.\nSome text: L'homme peut, par la violence ou par des menaces de violence, dissuader sa partenaire de subir un test de dépistage.\n\nTranslate to English.\nTranslation: A woman's decision to be tested is similarly negatively influenced by actual or threat of violence from her partner.\nSome text: Royaume-Uni (25599/94), Cour, 23 septembre 1998, Recueil des arrêts et décisions 1998-VI Affaire grecque (3321/67, 3322/67, 3323/67 et 3344/67), rapport de la Commission du 5 novembre 1969, Annuaire XII (1969) « L’affaire grecque » Ahmed c.\n\nTranslate to English.\nTranslation:"}]}
{"question_id": "1528", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Concurrent Parsing of Constituency and Dependency\nAbstract: Constituent and dependency representation for syntactic structure share a lot of linguistic and computational characteristics, this paper thus makes the first attempt by introducing a new model that is capable of parsing constituent and dependency at the same time, so that lets either of the parsers enhance each other. Especially, we evaluate the effect of different shared network components and empirically verify that dependency parsing may be much more beneficial from constituent parsing structure. The proposed parser achieves new state-of-the-art performance for both parsing tasks, constituent and dependency on PTB and CTB benchmarks.\n\nHow is dependency parsing empirically verified?"}]}
{"question_id": "1531", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To start writing a book."}]}
{"question_id": "1539", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Understanding Car-Speak: Replacing Humans in Dealerships\nAbstract: A large portion of the car-buying experience in the United States involves interactions at a car dealership. At the dealership, the car-buyer relays their needs to a sales representative. However, most car-buyers are only have an abstract description of the vehicle they need. Therefore, they are only able to describe their ideal car in \"car-speak\". Car-speak is abstract language that pertains to a car's physical attributes. In this paper, we define car-speak. We also aim to curate a reasonable data set of car-speak language. Finally, we train several classifiers in order to classify car-speak.\n\nIs car-speak language collection of abstract features that classifier is later trained on?"}]}
{"question_id": "1544", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "To prevent the plastic covering on a lamp from melting, you should"}]}
{"question_id": "1553", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Prose for a Painting\nAbstract: Painting captions are often dry and simplistic which motivates us to describe a painting creatively in the style of Shakespearean prose. This is a difficult problem, since there does not exist a large supervised dataset from paintings to Shakespearean prose. Our solution is to use an intermediate English poem description of the painting and then apply language style transfer which results in Shakespearean prose describing the painting. We rate our results by human evaluation on a Likert scale, and evaluate the quality of language style transfer using BLEU score as a function of prose length. We demonstrate the applicability and limitations of our approach by generating Shakespearean prose for famous paintings. We make our models and code publicly available.\n\nWhat limitations do the authors demnostrate of their model?"}]}
{"question_id": "1556", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "What are the championships won by LeBron James and what is his nationality?"}]}
{"question_id": "1558", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Ms. Bristol measured the mass of a closed beaker containing several ice cubes. The mass was 100 g. An hour later, after the ice cubes had melted, Ms. Bristol measured the mass of the beaker again. What was the mass of the beaker of water the second time?"}]}
{"question_id": "1560", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Reduce the risk of heart disease."}]}
{"question_id": "1563", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How to care for stitches."}]}
{"question_id": "1564", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To measure a piece of material to make slippers, you can"}]}
{"question_id": "1565", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Make a t-shirt from a hoody?"}]}
{"question_id": "1566", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to store leftover tomato paste"}]}
{"question_id": "1570", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Il mio telefono non riesce a visualizzare questa emoji 🫄🏾, cosa significa?"}]}
{"question_id": "1575", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "keep jewelry tangle-free and organized during the move"}]}
{"question_id": "1576", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "¿Crees que el reciente auge de las inteligencias artificiales afectara de forma positiva o negativa a la humanidad?"}]}
{"question_id": "1577", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How do I make sure that my cookies don't stick to the cookie sheet?"}]}
{"question_id": "1581", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How can I improve the water flow of a simple watering can made from a plastic jug?"}]}
{"question_id": "1586", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "In this task, you are given an input list A comprising of numbers and alphabets. You need to extract and sort the unique alphabets in the list. The alphabets in the input list will only be in lowercase. Return -1 if there is no alphabet in the input list.\nQ: ['2643', '1571', '4613', 'j', 'm', 'h', '3395', 'p', '6831', 's', '4369', '2845', 'k', 'e', 'e', '1915', 'w', 'x', 'w', '1741', 'p', '3757', 't', 'y', 'q', 'a']\nA:"}]}
{"question_id": "1587", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Question: Title: waste of time & money Review: i'm sure author is a nice guy and a decent artist, but it's hard to believe this got published. obviously wasn't edited. everything imparted is just common sense. geared to street artists. save your money. read free articles on internet. seriously. Does this product review convey a negative or positive sentiment?\nAnswer: Negative\n\nQuestion: Title: what a fun and educational book! Review: this is a great read to share with young elementary age children that weaves fun stories and great lessons about the importance of good manners and character for life. Does this product review convey a negative or positive sentiment?\nAnswer: Positive\n\nQuestion: Title: Daddy's not Amish Review: A wonderful book. Even if you aren't a rich cable havin geek, you can at least appreciate the genius of these two men. This book is most interesting when it discusses L.A.'s alternative comedy scene. I guess these two exemplify(sic)belly laughs without the yuk yuk shave your chest yakov smirnov hullabaloo. Does this product review convey a negative or positive sentiment?\nAnswer:"}]}
{"question_id": "1592", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Does the Ramstein Air Base have a hospital?"}]}
{"question_id": "1621", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "¿Que hace 'continue' en este codigo de Javascript? \n           \"var sum = 0;\n            for (i =3; i<10; i++)\n            {\n                if (i ==7)\n                {\n                    continue;\n                }\n            \n                sum += i; \n                document.write(sum);\n            }\n\""}]}
{"question_id": "1625", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Does Yoshihide Suga have a higher approval rating than Shinzo Abe?"}]}
{"question_id": "1628", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "What would you say if you had to call a doctor to schedule an appointment to get your toe removed due to stubbing your toe really hard on the way to deliver a letter to santa?"}]}
{"question_id": "1629", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "What is the circulation of The New York Times and what is its editorial stance?"}]}
{"question_id": "1630", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To thin acrylic paints, you can"}]}
{"question_id": "1634", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to make pistachio-cherry buttons"}]}
{"question_id": "1645", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: How To Avoid Being Eaten By a Grue: Exploration Strategies for Text-Adventure Agents\nAbstract: Text-based games -- in which an agent interacts with the world through textual natural language -- present us with the problem of combinatorially-sized action-spaces. Most current reinforcement learning algorithms are not capable of effectively handling such a large number of possible actions per turn. Poor sample efficiency, consequently, results in agents that are unable to pass bottleneck states, where they are unable to proceed because they do not see the right action sequence to pass the bottleneck enough times to be sufficiently reinforced. Building on prior work using knowledge graphs in reinforcement learning, we introduce two new game state exploration strategies. We compare our exploration strategies against strong baselines on the classic text-adventure game, Zork1, where prior agent have been unable to get past a bottleneck where the agent is eaten by a Grue.\n\nWhat are the results from these proposed strategies?"}]}
{"question_id": "1654", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Brittany pedaled her bicycle quickly on a level surface. When she stopped pedaling and coasted, the bicycle slowed and came to a stop. What happened to the energy of the moving bicycle as it coasted to a stop?"}]}
{"question_id": "1656", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "At science conventions, scientists present their research, and members of the audience can discuss or ask questions about the research. The main value of these science conventions is that they allow scientists to"}]}
{"question_id": "1670", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "The longitude of a location determines which time zone it is in. Different time zones are the result of"}]}
{"question_id": "1675", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "how do you edit an order at a drive thru?"}]}
{"question_id": "1685", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "What is the best size for a napkin holder?"}]}
{"question_id": "1688", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: What Drives the International Development Agenda? An NLP Analysis of the United Nations General Debate 1970-2016\nAbstract: There is surprisingly little known about agenda setting for international development in the United Nations (UN) despite it having a significant influence on the process and outcomes of development efforts. This paper addresses this shortcoming using a novel approach that applies natural language processing techniques to countries' annual statements in the UN General Debate. Every year UN member states deliver statements during the General Debate on their governments' perspective on major issues in world politics. These speeches provide invaluable information on state preferences on a wide range of issues, including international development, but have largely been overlooked in the study of global politics. This paper identifies the main international development topics that states raise in these speeches between 1970 and 2016, and examine the country-specific drivers of international development rhetoric.\n\nHow are the main international development topics that states raise identified?"}]}
{"question_id": "1695", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What determines if twins are identical?"}]}
{"question_id": "1696", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How to fix a plastic key holder which is broken or split?"}]}
{"question_id": "1698", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Which is the most likely response of a human to an increase in temperature?"}]}
{"question_id": "1701", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To perform an update on your phone."}]}
{"question_id": "1709", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How long does it take to charge the battery of the Tesla Model S?"}]}
{"question_id": "1710", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To remove glue from pre-glued veneer with little effort."}]}
{"question_id": "1713", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Preparing a Banana Milkshake Hair Mask"}]}
{"question_id": "1714", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to Prepare SKittles Candy for Candy Chromatography"}]}
{"question_id": "1717", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "What AQI level is it acceptable to walk around without mask in?"}]}
{"question_id": "1727", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "A laser beam is aimed at four different objects. Through which of these objects will the laser beam pass and be refracted?"}]}
{"question_id": "1738", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "When someone plays the flute, sound is produced because the air in the flute is"}]}
{"question_id": "1742", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to remove the seems from jeans and turn into a skirt?"}]}
{"question_id": "1753", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How to fix the problem of a slippery spot on the floor."}]}
{"question_id": "1754", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Explain simply why ante meridiem , meaning before midday is the correct answer to: Passage: The 12-hour clock is a time convention in which the 24 hours of the day are divided into two periods: a.m. (from the Latin, ante meridiem, meaning before midday) and p.m. (post meridiem, meaning past midday). Each period consists of 12 hours numbered: 12 (acting as zero), 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, and 11. The 24 hour / day cycle starts at 12 midnight (often indicated as 12 a.m.), runs through 12 noon (often indicated as 12 p.m.), and continues to the midnight at the end of the day. The 12-hour clock was developed over time from the mid-second millennium BC to the 16th century AD.\n\nQuestion: Based on this passage, what is meaning of am and pm in time?. Explanation:"}]}
{"question_id": "1755", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "The organisms that convert solar energy and raw materials into food are"}]}
{"question_id": "1764", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to keep herbs from going limp"}]}
{"question_id": "1766", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "Structuring a Study Group"}]}
{"question_id": "1767", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To remove clumps from cornstarch, you can"}]}
{"question_id": "1781", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: MIT-QCRI Arabic Dialect Identification System for the 2017 Multi-Genre Broadcast Challenge\nAbstract: In order to successfully annotate the Arabic speech con- tent found in open-domain media broadcasts, it is essential to be able to process a diverse set of Arabic dialects. For the 2017 Multi-Genre Broadcast challenge (MGB-3) there were two possible tasks: Arabic speech recognition, and Arabic Dialect Identification (ADI). In this paper, we describe our efforts to create an ADI system for the MGB-3 challenge, with the goal of distinguishing amongst four major Arabic dialects, as well as Modern Standard Arabic. Our research fo- cused on dialect variability and domain mismatches between the training and test domain. In order to achieve a robust ADI system, we explored both Siamese neural network models to learn similarity and dissimilarities among Arabic dialects, as well as i-vector post-processing to adapt domain mismatches. Both Acoustic and linguistic features were used for the final MGB-3 submissions, with the best primary system achieving 75% accuracy on the official 10hr test set.\n\nHow do they explore domain mismatch?"}]}
{"question_id": "1784", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "In this task, you have given an input which is agent's reply, based on that you have to identify what will be users' command for that reply. The user generally asks a question related to event scheduling or information of the scheduled events. Agent reply based on the available information or do the task as per user command.\nExample: I didn't find any events with Gavin this week\nExample solution: Search for any meetings with Gavin for this week.\nExample explanation: The agent has replied about the events with Gavin, and the user has also asked about the same thing.\n\nProblem: I didn't find any events matching \"dentist appointment\"."}]}
{"question_id": "1787", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Contextual Joint Factor Acoustic Embeddings\nAbstract: Embedding acoustic information into fixed length representations is of interest for a whole range of applications in speech and audio technology. We propose two novel unsupervised approaches to generate acoustic embeddings by modelling of acoustic context. The first approach is a contextual joint factor synthesis encoder, where the encoder in an encoder/decoder framework is trained to extract joint factors from surrounding audio frames to best generate the target output. The second approach is a contextual joint factor analysis encoder, where the encoder is trained to analyse joint factors from the source signal that correlates best with the neighbouring audio. To evaluate the effectiveness of our approaches compared to prior work, we chose two tasks - phone classification and speaker recognition - and test on different TIMIT data sets. Experimental results show that one of our proposed approaches outperforms phone classification baselines, yielding a classification accuracy of 74.1%. When using additional out-of-domain data for training, an additional 2-3% improvements can be obtained, for both for phone classification and speaker recognition tasks.\n\nWhich approach out of two proposed in the paper performed better in experiments?"}]}
{"question_id": "1794", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Structuring an unordered text document\nAbstract: Segmenting an unordered text document into different sections is a very useful task in many text processing applications like multiple document summarization, question answering, etc. This paper proposes structuring of an unordered text document based on the keywords in the document. We test our approach on Wikipedia documents using both statistical and predictive methods such as the TextRank algorithm and Google's USE (Universal Sentence Encoder). From our experimental results, we show that the proposed model can effectively structure an unordered document into sections.\n\nWhat kind of model do they use?"}]}
{"question_id": "1797", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Make a deli submarine sandwich."}]}
{"question_id": "1801", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "average height for a male"}]}
{"question_id": "1806", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a sentence in Portuguese. Your job is to translate the Portuguese sentence into Hebrew.\n\nExample input: Afinal de contas elas é que decidem, e decidiram mesmo.\nExample output: אחרי הכל, הם החליטו, והם עשו,\nExample explanation: The Portugese sentence is correctly translated into Hebrew, because the meaning is preserved.\nQ: E conseguiu-o.\nA:"}]}
{"question_id": "1819", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Hola, ¿me podrías decir a cuantos kilómetros equivale un milla náutica?¿Se sigue usando la milla náutica como medida de longitud recurrentemente en algún ámbito?"}]}
{"question_id": "1821", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Does JPMorgan Chase & Co. offer private banking services?"}]}
{"question_id": "1822", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Instructions: In this task you will be given a list of integers. You should find the minimum absolute difference between 2 integers in the list. The absolute difference is the absolute value of one integer subtracted by another. The output should be a single integer which is the smallest possible absolute distance.\nInput: [-11, 79, 51, 95, -20, -99, 81, -27]\nOutput:"}]}
{"question_id": "1825", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Why should scientists wear goggles during experiments?"}]}
{"question_id": "1827", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "For many years, people have been curious about the stars. In the past, people have shared what they knew about the stars through stories and drawings. Which pair of tools would be most helpful for people today to gather and share information about stars?"}]}
{"question_id": "1832", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Me diga bons canais de Minecraft brasileiros para eu assistir"}]}
{"question_id": "1839", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "How do the menus of Pure Vida and Gracias Madre compare?"}]}
{"question_id": "1840", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What procedure should be performed after any handling of a plant sample in a lab?"}]}
{"question_id": "1843", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Make turmeric milk"}]}
{"question_id": "1845", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To convert cheese into liquid state, you can"}]}
{"question_id": "1847", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "how to freeze chipotle peppers in adobo sauce"}]}
{"question_id": "1851", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Which action involving a pulley system requires the least amount of force?"}]}
{"question_id": "1852", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Who were the major participants in the Vietnam War?"}]}
{"question_id": "1859", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To prevent overfilling the pots with the brownie batter"}]}
{"question_id": "1860", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Prevent crying when chopping onions."}]}
{"question_id": "1864", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Instructions: Classify the given tweet into the three categories: (1) 'Hate Speech', (2) 'Offensive' and (3) 'Neither'. 'Hate Speech' is kind of a threating statement or sometimes include call for violence while 'offensive' statement just offensds someone. 'Neither' is when it doesn't fall into Hate Speech or Offensive category.\nInput: They slut for me they kill for me they steal for me and of course it'll be yo cash and I'll murder that bitch send the body back to yo ass\nOutput:"}]}
{"question_id": "1871", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Are there other trees besides maple trees that you can tap for maple syrup?"}]}
{"question_id": "1876", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "How to decorate for the Holidays."}]}
{"question_id": "1892", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Test out rain protection of new home."}]}
{"question_id": "1898", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What are petri dishes used for in a lab?"}]}
{"question_id": "1902", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What process forms an image in a mirror?"}]}
{"question_id": "1903", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Who is currently the Prime Minister of Italy?"}]}
{"question_id": "1905", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Toni got a cut on her arm while playing in a softball game. A few weeks later, the cut was healed. Which process is most responsible for repairing the cut?"}]}
{"question_id": "1906", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Is the RAM capacity of the Alienware M17 R4 larger than the RAM capacity of the MSI Prestige 14 Evo?"}]}
{"question_id": "1908", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Water that evaporates from lakes and streams condenses into clouds and later falls as rain. The property of water that is demonstrated is the ability to"}]}
{"question_id": "1912", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To make a bar cart out of IKEA furnitire"}]}
{"question_id": "1913", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "New vaccines for diseases are being developed all the time. How do vaccines most likely help people?"}]}
{"question_id": "1915", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Context: 2008年5月31日 随笔档案 - 狼爱上狸 - BlogJava\n本地搭建以太坊私有网络-基于Ganache和MetaMask\n本文主要介绍如何使用Ganache，在本地搭建以太坊私有网络，并进行简单的测试。\nGanache用于搭建私有网络。在开发和测试环境下，Ganache提供了非常简便的以太坊私有网络搭建方法，通过可视化界面可以直观地设置各种参数、浏览查看账户和交易等数据。\n下载地址为：https://truffleframework.com/ganache/\nMetaMask用于测试私有网络。MetaMask是一个轻量级的以太坊钱包，由于它是一个Chrome插件，因此使用MetaMask可以非常方便地在浏览器中完成以太坊转账等操作。\n下载地址为：https://www.metamask.io\n安装、启动Ganache\n1. 使用安装包安装即可。\n2. 打开程序后，会显示以下界面，用户可以查看账户（默认创建10个账户）、区块、交易和日志。\n3. 点击“设置”，如下图所示，用户还可以设置绑定的ip和端口（设置为8545即可，稍后MetaMask会用这个端口）、账户数量以及gas限制等，点击“restart”后设置生效。\n此时，Ganache已经在本机运行了一个以太坊私有网络，并绑定了8545端口。\n安装、启动MetaMask\n1. 把插件添加到chrome扩展程序即可\n2. 点击Chrome中的MetaMask图标，按照每一步提示启动MetaMask\n3. 如下图所示，设置MetaMask连接到本地的以太坊私有网络\n此时，MetaMask就可以和本地的以太坊私有网络进行交互了。\n用MetaMask测试私有网络\n1. 从Ganache创建的账户中选择一个导入到MetaMask中\na. 在Ganache账户页面选定一个账户，点击最右边的小钥匙图标，复制其私钥（private key）\nb. 在MetaMask中点击头像，选择 “import account”，弹出对话框\nc. 把复制的账户私钥填入文本框中，并点击“import”\n此时，MetaMask就可以操作这个新账户了。\n2. 用新导入的账户进行转账\na. 点击“send”按钮，弹出转账对话框\nb. 从Ganache账户页面中，再选定一个其他的账户，复制其地址\nc. 把复制的地址填入到 “to” 文本框中，并在“amount”文本框中填入一个数值，表示要转账的金额（如 “10”）；其它文本框默认值即可\nd. 点击next，弹出转账确认框，点击“confirm”确认交易\ne. 提醒转账成功后，可以看到账户余额发生了变化，此时再转到Ganache账户页面，也可看到两个账户的余额也都发生了变化。\n由于Ganache的交易数据是在内存中操作的，并没有持久化到本地硬盘中，因此每次Ganache重启后，其上一次的交易记录就没有了，都是重新开始的。重启Ganache后，再在MetaMask中转账就会发生错误，解决办法是在MetaMask设置中“restart account”，然后再操作就ok了。\n如果想保留Ganache每一次运行时的交易数据，以便下一次继续使用，可以使用命令行的形式ganache-cli启动Ganache，并指定数据存储目录\n作者：BigCuttie\n原文：https://blog.csdn.net/starleelzx/article/details/82943530\nwebstrom下载安装\n1.https://www.jetbrains.com/webstorm/download/ 下载2019.1.3版\n2.在网盘开发软件下载JetbrainsCrack3.4.jar、汉化包和激活码软件。\n3.将解压的.jar 破解补丁放在你的安装idea下面的bin的目录下面。如C:\\JetBrains\\WebStorm\\bin\n4.在安装的idea下面的bin目录下面有2个文件 ： 一个是webstorm.exe.vmoptions，还有一个是webstorm64.exe.vmoptions。用记事本打开 分别在最下面一行增加一行：\n-javaagent:C:\\JetBrains\\WebStorm\\bin\\JetbrainsCrack3.4.jar\n5.重启一下软件，在进入出现有active code选择界面的时候，打开激活码.txt文件，输入即可，能够进入应用界面则表示安装破解成功\n安装intelliJ IDEA2018.3\n1.https://www.jetbrains.com/idea/download/previous.html 下载2018.3.6版本；\n2.在网盘开发软件下载JetbrainsCrack_jb51.rar软件，里面包含了JetbrainsCrack-4.2-release-enc.jar文件。\n3.将解压的.jar 破解补丁放在你的安装idea下面的bin的目录下面。如C:\\JetBrains\\IntelliJ\\bin\n4.在安装的idea下面的bin目录下面有2个文件 ： 一个是idea64.exe.vmoptions，还有一个是idea.exe.vmoptions。用记事本打开 分别在最下面一行增加一行：\n-javaagent:C:\\JetBrains\\IntelliJ\\bin\\JetbrainsCrack-4.2-release-enc.jar\n5.重启一下软件，在进入出现有active code选择界面的时候，随便输入几个字母即可，能够进入应用界面则表示安装破解成功。\nUbuntu16 升级nodejs版本\nUbuntu16下，使用apt-get下载的nodejs最新版本为v4.2.6，而react-native需要v8.x及以上的版本\n在网上找到了这一篇博客Ubuntu安装最新版nodejs，用npm安装了Node工具包n，使用该工具包将nodejs安装到了目前的最新版本v10.6.0。在已经安装npm的基础上，具体操作如下：\nn是一个Node工具包，它提供了几个升级命令参数：\nn 显示已安装的Node版本\nn latest 安装最新版本Node\nn stable 安装最新稳定版Node\nn lts 安装最新长期维护版(lts)Node\nn version 根据提供的版本号安装Node\n作者：LDY_T\n原文：https://blog.csdn.net/u010277553/article/details/80938829\n献给那些安装remix-ide一直不成功的windows用户\n首先找到编译器git地址，https://github.com/ethereum/remix-ide；\n进来后有安装步骤\n/home/water/下载/3486521-922a751008a61222.png\nremix-ide.png\n如果我们电脑上没有node.js先登录下面的网址安装\n因为安装的过程中需要的权限功能比较多所以得用管理员执行powershell 不建议使用cmd操作\n安装好之后查看自己的 输入命令npm -v ，查看npm版本号如果低于6.1.0。输入 npm install npm@latest -g 升级npm版本号，这个版本比较稳定\n然后执行npm install remix-ide -g\n接着执行remix-ide\n登录http://127.0.0.1:8080\n如果不成功 执行 npm install --global --production windows-build-tools\n然后再执行上面的步骤八成就可以了，remix-ide需要的环境还挺多\n作者：刘阿火\n链接：https://www.jianshu.com/p/fb198cd619b9\nwindows之geth账户建立\n建立新账号，最好用>personal.newAccount();\n而不要用C:\\Users\\Administrator\\geth account new 命令；\n不然账户地址建立在C:\\Users\\Administrator\\AppData\\Roaming\\Ethereum\\keystore下，而不是在\nC:\\Users\\Administrator\\test\\keystore；从而挖矿时出现错误。\nIPFS(DRAFT 3) 中文版白皮书\nhttps://blog.csdn.net/easylover/article/details/82733578\nAkasha——基于以太坊和IPFS的社交网络\n在Akasha项目组测试各种代币模型并追求最优解决方案之后。\nAkasha项目同时使用了以太坊和IPFS技术，创建一个去中心化的社交网络。以太坊提供了身份系统、微支付等支持，IPFS提供了内容存储、分发等支持。最近Akasha发布了0.3.0测试版，爱折腾的用户可以在Akasha创建的以太坊私有测试网络上体验这个追逐理想的项目。\n说再多的理论，不如动手尝试。现在使用Akasha比较容易，无论你使用Windows操作系统，还是Mac操作系统，还是Linux系统，都可以一键安装。下载地址：https://github.com/AkashaProject/Alpha/releases/tag/0.3.0\n安装完成后，进入设置阶段。如果你以前安装过以太坊Go客户端或者IPFS客户端，选择“Advanced”，自定义配置。如果没有安装过，选择“Express setup”(快速安装)。\nAkasha后台的以太坊G\nQuestion: 如何安装并启动Ganache?"}]}
{"question_id": "1919", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Is it possible to surf on Tidal bore?"}]}
{"question_id": "1920", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "To prevent getting your hand burned when driving an automatic car on a hot day,"}]}
{"question_id": "1922", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Earth's rotation (turning on its axis) causes"}]}
{"question_id": "1927", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Genérame una función en Matlab que  donde se ingresen x1, y1, z1, x2, y2 y z2 y devuelva la distancia entre estos dos puntos en el espacio."}]}
{"question_id": "1929", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How can I stop a run in pantyhose from getting bigger?"}]}
{"question_id": "1938", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "To insulate wood from the sand in a desktop zen meditation garden."}]}
{"question_id": "1941", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "How to reserve a wedding venue"}]}
{"question_id": "1947", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Trim apple trees."}]}
{"question_id": "1948", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Given the following question, let's solve step-by-step. Is the following sentence factually correct?\n\"Judas Iscariot founded the company Delta Airlines.\"\nOptions:\n- yes\n- no"}]}
{"question_id": "1957", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Fit two bowls in a microwave."}]}
{"question_id": "1964", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What is the conductivity and durability of copper?"}]}
{"question_id": "1966", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "Are Metra Train and MARC Train the same type of train?"}]}
{"question_id": "1970", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to make a bookmark with Popsicle sticks."}]}
{"question_id": "1971", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Write a python script to simply display \"hello world!\""}]}
{"question_id": "1977", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Schreibe mir bitte eine Liste mit beliebten Softdrinks in Deutschland. Die Liste soll auch Energy Drinks beinhalten."}]}
{"question_id": "1986", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "To know when your plaster mold is ready to break open"}]}
{"question_id": "1989", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How to fix a dryer that is not drying."}]}
{"question_id": "1999", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Answer the following question.\nEmily just purchased 2 pairs of curtains for $30.00 each and 9 wall prints at $15.00 each. The store also offers an installation service. For $50.00 they will come to your house and professionally hang your curtains and prints. If Emily agrees to this service, how much will her entire order cost?\nStep-by-step reasoning process: She buys 2 pair of curtains for $30.00 each so that's 2 * 30 = $60.00. She buys 9 wall prints at $15.00 each so that's 9 * 15 = $135.00. The curtains cost $60.00, the prints are $135.00 and the installation service is $50.00 for a total of 60 + 135 + 50 = $245.00.\nThe answer is 245.\n\nAnswer the following question.\nA church has 100 members who've volunteered to bake cookies for the homeless in their local town. If each member baked 10 sheets of cookies, and each sheet has 16 cookies, calculate the total number of cookies the church members baked?\nStep-by-step reasoning process: A sheet has 16 cookies, so if each church member baked 10 sheets, they each baked 10 sheets / person * 16 cookies / sheet = 160 cookies / person. The total number of church members who decided to volunteer is 100, so in total, they baked 160 cookies / person * 100 people = 16000 cookies.\nThe answer is 16000.\n\nAnswer the following question.\nJuvy has a garden that has 20 rows with 10 plants in each row. She plants parsley in the first 3 rows and rosemary in the last two rows. The rest of the rows will be planted with chives. How many chives will Juvy plant?\nStep-by-step reasoning process: Juvy planted 3 + 2 = 5 rows with parsley and rosemary. So, 20 - 5 = 15 rows will be planted with chives. Therefore, 15 x 10 = 150 chives will be planted.\nThe answer is 150.\n\nAnswer the following question.\nBrittany has 3 gerbils: Puffy, Muffy, and Scruffy. Puffy weighs 5 ounces more than Muffy. Muffy weighs 3 ounces less than Scruffy. If Scruffy weighs 12 ounces, how much would the scale indicate, in ounces, if Brittany put Puffy and Muffy on the scale?"}]}
{"question_id": "2004", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: Exploring Scholarly Data by Semantic Query on Knowledge Graph Embedding Space\nAbstract: The trends of open science have enabled several open scholarly datasets which include millions of papers and authors. Managing, exploring, and utilizing such large and complicated datasets effectively are challenging. In recent years, the knowledge graph has emerged as a universal data format for representing knowledge about heterogeneous entities and their relationships. The knowledge graph can be modeled by knowledge graph embedding methods, which represent entities and relations as embedding vectors in semantic space, then model the interactions between these embedding vectors. However, the semantic structures in the knowledge graph embedding space are not well-studied, thus knowledge graph embedding methods are usually only used for knowledge graph completion but not data representation and analysis. In this paper, we propose to analyze these semantic structures based on the well-studied word embedding space and use them to support data exploration. We also define the semantic queries, which are algebraic operations between the embedding vectors in the knowledge graph embedding space, to solve queries such as similarity and analogy between the entities on the original datasets. We then design a general framework for data exploration by semantic queries and discuss the solution to some traditional scholarly data exploration tasks. We also propose some new interesting tasks that can be solved based on the uncanny semantic structures of the embedding space.\n\nWhat new interesting tasks can be solved based on the uncanny semantic structures of the embedding space?"}]}
{"question_id": "2005", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Viết cho tôi một dãy JSON gồm có tên, địa chỉ, và diện tích của rừng Tam Đảo."}]}
{"question_id": "2016", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How to get a ball point pen writing again when it stops, even though there is lots of ink in the pen?"}]}
{"question_id": "2017", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "Does PDI Perjuangan have clear policy positions?"}]}
{"question_id": "2018", "category": "brain-hard-v0.1", "cluster": "Social Sciences", "turns": [{"content": "when does the academic year start in Malaysia"}]}
{"question_id": "2027", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Protein is used by the human body to"}]}
{"question_id": "2028", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "How to make sure that a hairpiece is not visible in your hair?"}]}
{"question_id": "2060", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "How can I ask for help in Danish?"}]}
{"question_id": "2063", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "How do you cure concrete?"}]}
{"question_id": "2071", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "Erstelle eine CSV mit einer zusätzlichen Spalte für die Genres der folgenden Künstler:\n\n- In Flames\n- Electric Callboy\n- Sandra\n- Muse\n- Kraftklub\n- Bob Marley\n- Carpenter Brut\n- Dilla"}]}
{"question_id": "2078", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "To groom a dog's foot,"}]}
{"question_id": "2083", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "Eman biharko eguraldi iragarpena"}]}
{"question_id": "2088", "category": "brain-hard-v0.1", "cluster": "Lifestyle", "turns": [{"content": "To get dog urine smell out of carpet"}]}
{"question_id": "2094", "category": "brain-hard-v0.1", "cluster": "STEM", "turns": [{"content": "What is the fuel efficiency of Toyota Corolla?"}]}
{"question_id": "2101", "category": "brain-hard-v0.1", "cluster": "Food & Home", "turns": [{"content": "Where can a miniature BBQ grill be used?"}]}
{"question_id": "2104", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "instruction:\nIn this task, you are given a sentence in the english language. Here, your job is to convert english sentence into the bulgarian language.\nquestion:\nThere are two compromises between Parliament and the Council before us.\nanswer:\nПред нас стоят два компромиса, постигнати между Парламента и Съвета.\n\n\nquestion:\nI have recently been struck by the way that several Czech insurance companies have discontinued the provision of bonuses paid to women who take out compulsory car insurance policies.\nanswer:\nНеотдавна ми направи силно впечатление начинът, по който няколко чешки застрахователни дружества преустановиха предоставянето на бонуси, изплащани на жените, които закупуват задължителни автомобилни застрахователни полици.\n\n\nquestion:\nBetween cities, in standards of protection for the urban environment?\nanswer:"}]}
{"question_id": "2106", "category": "brain-hard-v0.1", "cluster": "Research & Technical", "turns": [{"content": "You are given a paper:\nTitle: VQABQ: Visual Question Answering by Basic Questions\nAbstract: Taking an image and question as the input of our method, it can output the text-based answer of the query question about the given image, so called Visual Question Answering (VQA). There are two main modules in our algorithm. Given a natural language question about an image, the first module takes the question as input and then outputs the basic questions of the main given question. The second module takes the main question, image and these basic questions as input and then outputs the text-based answer of the main question. We formulate the basic questions generation problem as a LASSO optimization problem, and also propose a criterion about how to exploit these basic questions to help answer main question. Our method is evaluated on the challenging VQA dataset and yields state-of-the-art accuracy, 60.34% in open-ended task.\n\nWhat accuracy do they approach with their proposed method?"}]}
{"question_id": "2107", "category": "brain-hard-v0.1", "cluster": "Arts & Literature", "turns": [{"content": "How does the accessibility of Praia do Camilo and Praia do Guincho compare?"}]}
